zoosmand/SAMD21G18A_eic/inc/samd21g18a.inc
SRAM_BASE             EQU 0x20000000   ;              ;/*!< SRAM base address in the alias region; */
PERIPH_BASE           EQU 0x40000000   ;              ;/*!< Peripheral base address in the alias region; */
	
FLASH_SIZE            EQU 0x40000 ;UL /* 256 kB */
FLASH_PAGE_SIZE       EQU 64
FLASH_NB_OF_PAGES     EQU 4096
FLASH_USER_PAGE_SIZE  EQU 64
HMCRAMC0_SIZE         EQU 0x8000 ;UL /* 32 kB */
FLASH_ADDR            EQU 0x00000000 ;UL) /**< FLASH base address */
FLASH_USER_PAGE_ADDR  EQU 0x00800000 ;UL) /**< FLASH_USER_PAGE base address */
HMCRAMC0_ADDR         EQU 0x20000000 ;UL) /**< HMCRAMC0 base address */

DSU_DID_RESETVALUE    EQU 0x10010005 ;UL
EIC_EXTINT_NUM        EQU 16
PORT_GROUPS           EQU 2

BIT_POS_0         	  EQU 0x00000001
BIT_POS_1         	  EQU 0x00000002
BIT_POS_2         	  EQU 0x00000004
BIT_POS_3         	  EQU 0x00000008
BIT_POS_4         	  EQU 0x00000010
BIT_POS_5         	  EQU 0x00000020
BIT_POS_6         	  EQU 0x00000040
BIT_POS_7         	  EQU 0x00000080
BIT_POS_8         	  EQU 0x00000100
BIT_POS_9         	  EQU 0x00000200
BIT_POS_10         	  EQU 0x00000400
BIT_POS_11         	  EQU 0x00000800
BIT_POS_12         	  EQU 0x00001000
BIT_POS_13         	  EQU 0x00002000
BIT_POS_14         	  EQU 0x00004000
BIT_POS_15         	  EQU 0x00008000
BIT_POS_16         	  EQU 0x00010000
BIT_POS_17         	  EQU 0x00020000
BIT_POS_18         	  EQU 0x00040000
BIT_POS_19         	  EQU 0x00080000
BIT_POS_20         	  EQU 0x00100000
BIT_POS_21         	  EQU 0x00200000
BIT_POS_22         	  EQU 0x00400000
BIT_POS_23         	  EQU 0x00800000
BIT_POS_24         	  EQU 0x01000000
BIT_POS_25         	  EQU 0x02000000
BIT_POS_26         	  EQU 0x04000000
BIT_POS_27         	  EQU 0x08000000
BIT_POS_28         	  EQU 0x10000000
BIT_POS_29         	  EQU 0x20000000
BIT_POS_30         	  EQU 0x40000000
BIT_POS_31         	  EQU 0x80000000





; Flags
FLAG_N								EQU 0x80000000
FLAG_Z								EQU 0x40000000
FLAG_C								EQU 0x20000000
FLAG_V								EQU 0x10000000


	



AC                    EQU 0x42004400 ; /**< \brief (AC) APB Base Address */
ADC                   EQU 0x42004000 ; /**< \brief (ADC) APB Base Address */
DAC                   EQU 0x42004800 ; /**< \brief (DAC) APB Base Address */
DMAC                  EQU 0x41004800 ; /**< \brief (DMAC) APB Base Address */
DSU                   EQU 0x41002000 ; /**< \brief (DSU) APB Base Address */
EIC                   EQU 0x40001800 ; /**< \brief (EIC) APB Base Address */
EVSYS                 EQU 0x42000400 ; /**< \brief (EVSYS) APB Base Address */
GCLK                  EQU 0x40000C00 ; /**< \brief (GCLK) APB Base Address */
SBMATRIX              EQU 0x41007000 ; /**< \brief (SBMATRIX) APB Base Address */
I2S                   EQU 0x42005000 ; /**< \brief (I2S) APB Base Address */
MTB                   EQU 0x41006000 ; /**< \brief (MTB) APB Base Address */
NVMCTRL               EQU 0x41004000 ; /**< \brief (NVMCTRL) APB Base Address */
NVMCTRL_CAL           EQU 0x00800000 ; /**< \brief (NVMCTRL) CAL Base Address */
NVMCTRL_LOCKBIT       EQU 0x00802000 ; /**< \brief (NVMCTRL) LOCKBIT Base Address */
NVMCTRL_OTP1          EQU 0x00806000 ; /**< \brief (NVMCTRL) OTP1 Base Address */
NVMCTRL_OTP2          EQU 0x00806008 ; /**< \brief (NVMCTRL) OTP2 Base Address */
NVMCTRL_OTP4          EQU 0x00806020 ; /**< \brief (NVMCTRL) OTP4 Base Address */
NVMCTRL_TEMP_LOG      EQU 0x00806030 ; /**< \brief (NVMCTRL) TEMP_LOG Base Address */
NVMCTRL_USER          EQU 0x00804000 ; /**< \brief (NVMCTRL) USER Base Address */
PAC0                  EQU 0x40000000 ; /**< \brief (PAC0) APB Base Address */
PAC1                  EQU 0x41000000 ; /**< \brief (PAC1) APB Base Address */
PAC2                  EQU 0x42000000 ; /**< \brief (PAC2) APB Base Address */
PM                    EQU 0x40000400 ; /**< \brief (PM) APB Base Address */
PORT                  EQU 0x41004400 ; /**< \brief (PORT) APB Base Address */
PORT_IOBUS            EQU 0x60000000 ; /**< \brief (PORT) IOBUS Base Address */
RTC                   EQU 0x40001400 ; /**< \brief (RTC) APB Base Address */
SERCOM                EQU 0x42000800 ; /**< \brief (SERCOM) APB Base Address */
SERCOM0               EQU 0x42000800 ; /**< \brief (SERCOM0) APB Base Address */
SERCOM1               EQU 0x42000C00 ; /**< \brief (SERCOM1) APB Base Address */
SERCOM2               EQU 0x42001000 ; /**< \brief (SERCOM2) APB Base Address */
SERCOM3               EQU 0x42001400 ; /**< \brief (SERCOM3) APB Base Address */
SERCOM4               EQU 0x42001800 ; /**< \brief (SERCOM4) APB Base Address */
SERCOM5               EQU 0x42001C00 ; /**< \brief (SERCOM5) APB Base Address */
SYSCTRL               EQU 0x40000800 ; /**< \brief (SYSCTRL) APB Base Address */
TC3                   EQU 0x42002C00 ; /**< \brief (TC3) APB Base Address */
TC4                   EQU 0x42003000 ; /**< \brief (TC4) APB Base Address */
TC5                   EQU 0x42003400 ; /**< \brief (TC5) APB Base Address */
TCC0                  EQU 0x42002000 ; /**< \brief (TCC0) APB Base Address */
TCC1                  EQU 0x42002400 ; /**< \brief (TCC1) APB Base Address */
TCC2                  EQU 0x42002800 ; /**< \brief (TCC2) APB Base Address */
USB                   EQU 0x41005000 ; /**< \brief (USB) APB Base Address */
WDT                   EQU 0x40001000; /**< \brief (WDT) APB Base Address */



JACKSON_5							EQU 0x00




SYST_CSR									EQU 0xe000e010

SYST_RVR_offset						EQU 0x04
SYST_CVR_offset						EQU 0x08
SYST_CALIB_offset					EQU 0x0c

SYST_RVR									EQU SYST_CSR + SYST_RVR_offset
SYST_CVR									EQU SYST_CSR + SYST_CVR_offset
SYST_CALIB								EQU SYST_CSR + SYST_CALIB_offset

SYST_CSR_ENABLE						EQU BIT_POS_0
SYST_CSR_TICKINT					EQU BIT_POS_1
SYST_CSR_CLOCKSOURCE			EQU BIT_POS_2
SYST_CSR_COUNTFLAG				EQU BIT_POS_16

SYST_RVR_RELOAD						EQU SYST_RVR

SYST_CVR_CURRENT					EQU SYST_CVR

SYST_CALIB_TENMS					EQU SYST_CALIB
SYST_CALIB_SKEW						EQU 0x40000000
SYST_CALIB_NOREF					EQU 0x10000000








NVICISER										EQU 0xe000e100
NVICISER_SETENA							EQU NVICISER
NVICICER										EQU 0xe000e180
NVICICER_CLRENA							EQU NVICICER
NVICISPR										EQU 0xe000e200
NVICISPR_SETPEND						EQU NVICISPR
NVICICPR										EQU 0xe000e280
NVICICPR_CLRPEND						EQU NVICICPR

