zoosmand/SAMD21G18A_eic/inc/samd21g18a.inc
NVICIPR											EQU 0xe000e400
NVICIPR0_offset							EQU 0x00
NVICIPR1_offset							EQU 0x04
NVICIPR2_offset							EQU 0x08
NVICIPR3_offset							EQU 0x0c
NVICIPR4_offset							EQU 0x10
NVICIPR5_offset							EQU 0x14
NVICIPR6_offset							EQU 0x18
NVICIPR7_offset							EQU 0x1c

NVICIPR0										EQU NVICIPR + NVICIPR0_offset
NVICIPR1										EQU NVICIPR + NVICIPR1_offset
NVICIPR2										EQU NVICIPR + NVICIPR2_offset
NVICIPR3										EQU NVICIPR + NVICIPR3_offset
NVICIPR4										EQU NVICIPR + NVICIPR4_offset
NVICIPR5										EQU NVICIPR + NVICIPR5_offset
NVICIPR6										EQU NVICIPR + NVICIPR6_offset
NVICIPR7										EQU NVICIPR + NVICIPR7_offset

NVIC_PRI0_Pos								EQU 0
NVIC_PRI1_Pos								EQU 8
NVIC_PRI2_Pos								EQU 16
NVIC_PRI3_Pos								EQU 24
NVIC_PRI_Mask								EQU 0xc0









PORT_offset								EQU 0x80
PORT0											EQU PORT
PORT1											EQU PORT0 + PORT_offset

PORT_DIR_offset						EQU 0x00
PORT_DIRCLR_offset				EQU 0x04
PORT_DIRSET_offset	      EQU 0x08
PORT_DIRTGL_offset				EQU 0x0c
PORT_OUT_offset						EQU 0x10
PORT_OUTCLR_offset				EQU 0x14
PORT_OUTSET_offset				EQU 0x18
PORT_OUTTGL_offset				EQU 0x1c
PORT_IN_offset						EQU 0x20
PORT_CTRL_offset					EQU 0x24
PORT_WRCONFIG_offset			EQU 0x28
PORT_PMUX_offset					EQU 0x30
PORT_PINCFG_offset				EQU 0x40

PORT0_DIR									EQU PORT0 + PORT_DIR_offset
PORT0_DIRCLR							EQU PORT0 + PORT_DIRCLR_offset
PORT0_DIRSET							EQU PORT0 + PORT_DIRSET_offset
PORT0_DIRTGL							EQU PORT0 + PORT_DIRTGL_offset
PORT0_OUT									EQU PORT0 + PORT_OUT_offset
PORT0_OUTCLR							EQU PORT0 + PORT_OUTCLR_offset
PORT0_OUTSET							EQU PORT0 + PORT_OUTSET_offset
PORT0_OUTTGL							EQU PORT0 + PORT_OUTTGL_offset
PORT0_IN									EQU PORT0 + PORT_IN_offset
PORT0_CTRL								EQU PORT0 + PORT_CTRL_offset
PORT0_WRCONFIG						EQU PORT0 + PORT_WRCONFIG_offset
PORT0_PMUX								EQU PORT0 + PORT_PMUX_offset
PORT0_PINCFG							EQU PORT0 + PORT_PINCFG_offset

PORT1_DIR									EQU PORT1 + PORT_DIR_offset
PORT1_DIRCLR							EQU PORT1 + PORT_DIRCLR_offset
PORT1_DIRSET							EQU PORT1 + PORT_DIRSET_offset
PORT1_DIRTGL							EQU PORT1 + PORT_DIRTGL_offset
PORT1_OUT									EQU PORT1 + PORT_OUT_offset
PORT1_OUTCLR							EQU PORT1 + PORT_OUTCLR_offset
PORT1_OUTSET							EQU PORT1 + PORT_OUTSET_offset
PORT1_OUTTGL							EQU PORT1 + PORT_OUTTGL_offset
PORT1_IN									EQU PORT1 + PORT_IN_offset
PORT1_CTRL								EQU PORT1 + PORT_CTRL_offset
PORT1_WRCONFIG						EQU PORT1 + PORT_WRCONFIG_offset
PORT1_PMUX								EQU PORT1 + PORT_PMUX_offset
PORT1_PINCFG							EQU PORT1 + PORT_PINCFG_offset

;PORT_DIR0            EQU 0x41004400 ; /**< \brief (PORT) Data Direction 0 */
;PORT_DIRCLR0         EQU 0x41004404 ; /**< \brief (PORT) Data Direction Clear 0 */
;PORT_DIRSET0         EQU 0x41004408 ; /**< \brief (PORT) Data Direction Set 0 */
;PORT_DIRTGL0         EQU 0x4100440C ; /**< \brief (PORT) Data Direction Toggle 0 */
;PORT_OUT0            EQU 0x41004410 ; /**< \brief (PORT) Data Output Value 0 */
;PORT_OUTCLR0         EQU 0x41004414 ; /**< \brief (PORT) Data Output Value Clear 0 */
;PORT_OUTSET0         EQU 0x41004418 ; /**< \brief (PORT) Data Output Value Set 0 */
;PORT_OUTTGL0         EQU 0x4100441C ; /**< \brief (PORT) Data Output Value Toggle 0 */
;PORT_IN0             EQU 0x41004420 ; /**< \brief (PORT) Data Input Value 0 */
;PORT_CTRL0           EQU 0x41004424 ; /**< \brief (PORT) Control 0 */
;PORT_WRCONFIG0       EQU 0x41004428 ; /**< \brief (PORT) Write Configuration 0 */
;PORT_PMUX0           EQU 0x41004430 ; /**< \brief (PORT) Peripheral Multiplexing 0 */
;PORT_PINCFG0         EQU 0x41004440 ; /**< \brief (PORT) Pin Configuration 0 */
;PORT_DIR1            EQU 0x41004480 ; /**< \brief (PORT) Data Direction 1 */
;PORT_DIRCLR1         EQU 0x41004484 ; /**< \brief (PORT) Data Direction Clear 1 */
;PORT_DIRSET1         EQU 0x41004488 ; /**< \brief (PORT) Data Direction Set 1 */
;PORT_DIRTGL1         EQU 0x4100448C ; /**< \brief (PORT) Data Direction Toggle 1 */
;PORT_OUT1            EQU 0x41004490 ; /**< \brief (PORT) Data Output Value 1 */
;PORT_OUTCLR1         EQU 0x41004494 ; /**< \brief (PORT) Data Output Value Clear 1 */
;PORT_OUTSET1         EQU 0x41004498 ; /**< \brief (PORT) Data Output Value Set 1 */
;PORT_OUTTGL1         EQU 0x4100449C ; /**< \brief (PORT) Data Output Value Toggle 1 */
;PORT_IN1             EQU 0x410044A0 ; /**< \brief (PORT) Data Input Value 1 */
;PORT_CTRL1           EQU 0x410044A4 ; /**< \brief (PORT) Control 1 */
;PORT_WRCONFIG1       EQU 0x410044A8 ; /**< \brief (PORT) Write Configuration 1 */
;PORT_PMUX1           EQU 0x410044B0 ; /**< \brief (PORT) Peripheral Multiplexing 1 */
;PORT_PINCFG1         EQU 0x410044C0 ; /**< \brief (PORT) Pin Configuration 1 */
	
PORT_PMUX_PMUXE_A        EQU 0x00
PORT_PMUX_PMUXE_B        EQU 0x01
PORT_PMUX_PMUXE_C        EQU 0x02
PORT_PMUX_PMUXE_D        EQU 0x03
PORT_PMUX_PMUXE_E        EQU 0x04
PORT_PMUX_PMUXE_F        EQU 0x05
PORT_PMUX_PMUXE_G        EQU 0x06
PORT_PMUX_PMUXE_H        EQU 0x07
PORT_PMUX_PMUXE_I        EQU 0x08

PORT_PMUX_PMUXO_A        EQU 0x00
PORT_PMUX_PMUXO_B        EQU 0x10
PORT_PMUX_PMUXO_C        EQU 0x20
PORT_PMUX_PMUXO_D        EQU 0x30
PORT_PMUX_PMUXO_E        EQU 0x40
PORT_PMUX_PMUXO_F        EQU 0x50
PORT_PMUX_PMUXO_G        EQU 0x60
PORT_PMUX_PMUXO_H        EQU 0x70
PORT_PMUX_PMUXO_I        EQU 0x80

PORT_PMUX_PMUX_A        EQU 0x0
PORT_PMUX_PMUX_B        EQU 0x1
PORT_PMUX_PMUX_C        EQU 0x2
PORT_PMUX_PMUX_D        EQU 0x3
PORT_PMUX_PMUX_E        EQU 0x4
PORT_PMUX_PMUX_F        EQU 0x5
PORT_PMUX_PMUX_G        EQU 0x6
PORT_PMUX_PMUX_H        EQU 0x7
PORT_PMUX_PMUX_I        EQU 0x8

PORT_PINCFG_PMUXEN				EQU 0x01
PORT_PINCFG_INEN					EQU 0x02
PORT_PINCFG_PULLEN				EQU 0x04
PORT_PINCFG_DRVSTR				EQU 0x40

PORT_WRCONFIG_PINMASK			EQU 0x0000
PORT_WRCONFIG_PMUXEN			EQU 0x00010000
PORT_WRCONFIG_INEN				EQU 0x00020000
PORT_WRCONFIG_PULLEN			EQU 0x00040000
PORT_WRCONFIG_DRVSTR			EQU 0x00400000
;PORT_WRCONFIG_PMUX				EQU 0x0000
PORT_WRCONFIG_PMUX_Pos		EQU 24
PORT_WRCONFIG_WRPMUX			EQU 0x10000000
PORT_WRCONFIG_WRPINCFG		EQU 0x40000000
PORT_WRCONFIG_HWSEL				EQU 0x80000000
	









GCLK_CTRL_offset					EQU 0x00
GCLK_STATUS_offset				EQU 0x01
GCLK_CLKCTRL_offset				EQU 0x02
GCLK_GENCTRL_offset				EQU 0x04
GCLK_GENDIV_offset				EQU 0x08

GCLK_CTRL									EQU GCLK + GCLK_CTRL_offset
GCLK_STATUS								EQU GCLK + GCLK_STATUS_offset
GCLK_CLKCTRL							EQU GCLK + GCLK_CLKCTRL_offset
GCLK_GENCTRL							EQU GCLK + GCLK_GENCTRL_offset
GCLK_GENDIV								EQU GCLK + GCLK_GENDIV_offset
	
