zoosmand/SAMD21G18A_eic/inc/samd21g18a.inc
GCLK_CTRL_SWRST						EQU BIT_POS_0
	
GCLK_STATUS_SYNCBUSY			EQU BIT_POS_7
GCLK_STATUS_SYNCBUSY_Pos	EQU 7

GCLK_CLKCTRL_ID_DFLL48				EQU 0x00 ;(GCLK_CLKCTRL_ID_DFLL48_Val    << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_FDPLL					EQU 0x01;(GCLK_CLKCTRL_ID_FDPLL_Val     << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_FDPLL32K			EQU 0x02;(GCLK_CLKCTRL_ID_FDPLL32K_Val  << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_WDT						EQU 0x03;(GCLK_CLKCTRL_ID_WDT_Val       << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_RTC						EQU 0x04;(GCLK_CLKCTRL_ID_RTC_Val       << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_EIC						EQU 0x05;(GCLK_CLKCTRL_ID_EIC_Val       << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_USB						EQU 0x06;(GCLK_CLKCTRL_ID_USB_Val       << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_EVSYS_0				EQU 0x07;(GCLK_CLKCTRL_ID_EVSYS_0_Val   << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_EVSYS_1				EQU 0x08;(GCLK_CLKCTRL_ID_EVSYS_1_Val   << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_EVSYS_2				EQU 0x09;(GCLK_CLKCTRL_ID_EVSYS_2_Val   << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_EVSYS_3				EQU 0x0a;(GCLK_CLKCTRL_ID_EVSYS_3_Val   << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_EVSYS_4				EQU 0x0b;(GCLK_CLKCTRL_ID_EVSYS_4_Val   << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_EVSYS_5				EQU 0x0c;(GCLK_CLKCTRL_ID_EVSYS_5_Val   << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_EVSYS_6				EQU 0x0d;(GCLK_CLKCTRL_ID_EVSYS_6_Val   << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_EVSYS_7				EQU 0x0e;(GCLK_CLKCTRL_ID_EVSYS_7_Val   << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_EVSYS_8				EQU 0x0f;(GCLK_CLKCTRL_ID_EVSYS_8_Val   << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_EVSYS_9				EQU 0x10;(GCLK_CLKCTRL_ID_EVSYS_9_Val   << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_EVSYS_10			EQU 0x11;(GCLK_CLKCTRL_ID_EVSYS_10_Val  << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_EVSYS_11			EQU 0x12;(GCLK_CLKCTRL_ID_EVSYS_11_Val  << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_SERCOMX_SLOW	EQU 0x13;(GCLK_CLKCTRL_ID_SERCOMX_SLOW_Val << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_SERCOM0_CORE	EQU 0x14;(GCLK_CLKCTRL_ID_SERCOM0_CORE_Val << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_SERCOM1_CORE	EQU 0x15;(GCLK_CLKCTRL_ID_SERCOM1_CORE_Val << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_SERCOM2_CORE	EQU 0x16;(GCLK_CLKCTRL_ID_SERCOM2_CORE_Val << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_SERCOM3_CORE	EQU 0x17;(GCLK_CLKCTRL_ID_SERCOM3_CORE_Val << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_SERCOM4_CORE	EQU 0x18;(GCLK_CLKCTRL_ID_SERCOM4_CORE_Val << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_SERCOM5_CORE	EQU 0x19;(GCLK_CLKCTRL_ID_SERCOM5_CORE_Val << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_TCC0_TCC1			EQU 0x1a;(GCLK_CLKCTRL_ID_TCC0_TCC1_Val << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_TCC2_TC3			EQU 0x1b;(GCLK_CLKCTRL_ID_TCC2_TC3_Val  << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_TC4_TC5				EQU 0x1c;(GCLK_CLKCTRL_ID_TC4_TC5_Val   << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_TC6_TC7				EQU 0x1d;(GCLK_CLKCTRL_ID_TC6_TC7_Val   << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_ADC						EQU 0x1e;(GCLK_CLKCTRL_ID_ADC_Val       << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_AC_DIG				EQU 0x1f;(GCLK_CLKCTRL_ID_AC_DIG_Val    << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_AC_ANA				EQU 0x20;(GCLK_CLKCTRL_ID_AC_ANA_Val    << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_DAC						EQU 0x21;(GCLK_CLKCTRL_ID_DAC_Val       << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_PTC						EQU 0x22;(GCLK_CLKCTRL_ID_PTC_Val       << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_I2S_0					EQU 0x23;(GCLK_CLKCTRL_ID_I2S_0_Val     << GCLK_CLKCTRL_ID_Pos)
GCLK_CLKCTRL_ID_I2S_1					EQU 0x24;(GCLK_CLKCTRL_ID_I2S_1_Val     << GCLK_CLKCTRL_ID_Pos)

GCLK_CLKCTRL_GEN_GCLK0				EQU 0x0000  ;GCLK_CLKCTRL_GEN_GCLK0_Val    << GCLK_CLKCTRL_GEN_Pos)
GCLK_CLKCTRL_GEN_GCLK1				EQU 0x0100  ;GCLK_CLKCTRL_GEN_GCLK1_Val    << GCLK_CLKCTRL_GEN_Pos)
GCLK_CLKCTRL_GEN_GCLK2				EQU 0x0200  ;GCLK_CLKCTRL_GEN_GCLK2_Val    << GCLK_CLKCTRL_GEN_Pos)
GCLK_CLKCTRL_GEN_GCLK3				EQU 0x0300  ;GCLK_CLKCTRL_GEN_GCLK3_Val    << GCLK_CLKCTRL_GEN_Pos)
GCLK_CLKCTRL_GEN_GCLK4				EQU 0x0400  ;GCLK_CLKCTRL_GEN_GCLK4_Val    << GCLK_CLKCTRL_GEN_Pos)
GCLK_CLKCTRL_GEN_GCLK5				EQU 0x0500  ;GCLK_CLKCTRL_GEN_GCLK5_Val    << GCLK_CLKCTRL_GEN_Pos)
GCLK_CLKCTRL_GEN_GCLK6				EQU 0x0600 	;GCLK_CLKCTRL_GEN_GCLK6_Val    << GCLK_CLKCTRL_GEN_Pos)
GCLK_CLKCTRL_GEN_GCLK7				EQU 0x0700  ;GCLK_CLKCTRL_GEN_GCLK7_Val    << GCLK_CLKCTRL_GEN_Pos)

GCLK_CLKCTRL_CLKEN						EQU BIT_POS_14
GCLK_CLKCTRL_WRTLOCK					EQU BIT_POS_15
	
GCLK_GENCTRL_ID								EQU 0x00
GCLK_GENCTRL_ID_Pos						EQU 0
GCLK_GENCTRL_SRC_XOSC					EQU 0x0000  ;GCLK_GENCTRL_SRC_XOSC_Val     << GCLK_GENCTRL_SRC_Pos)
GCLK_GENCTRL_SRC_GCLKIN				EQU 0x0100  ;GCLK_GENCTRL_SRC_GCLKIN_Val   << GCLK_GENCTRL_SRC_Pos)
GCLK_GENCTRL_SRC_GCLKGEN1			EQU 0x0200  ;GCLK_GENCTRL_SRC_GCLKGEN1_Val << GCLK_GENCTRL_SRC_Pos)
GCLK_GENCTRL_SRC_OSCULP32K		EQU 0x0300  ;GCLK_GENCTRL_SRC_OSCULP32K_Val << GCLK_GENCTRL_SRC_Pos)
GCLK_GENCTRL_SRC_OSC32K				EQU 0x0400  ;GCLK_GENCTRL_SRC_OSC32K_Val   << GCLK_GENCTRL_SRC_Pos)
GCLK_GENCTRL_SRC_XOSC32K			EQU 0x0500  ;GCLK_GENCTRL_SRC_XOSC32K_Val  << GCLK_GENCTRL_SRC_Pos)
GCLK_GENCTRL_SRC_OSC8M				EQU 0x0600  ;GCLK_GENCTRL_SRC_OSC8M_Val    << GCLK_GENCTRL_SRC_Pos)
GCLK_GENCTRL_SRC_DFLL48M			EQU 0x0700  ;GCLK_GENCTRL_SRC_DFLL48M_Val  << GCLK_GENCTRL_SRC_Pos)
GCLK_GENCTRL_SRC_FDPLL				EQU 0x0800  ;GCLK_GENCTRL_SRC_FDPLL_Val    << GCLK_GENCTRL_SRC_Pos)
GCLK_GENCTRL_GENEN						EQU BIT_POS_16
GCLK_GENCTRL_IDC							EQU BIT_POS_17
GCLK_GENCTRL_OOV							EQU BIT_POS_18
GCLK_GENCTRL_OE								EQU BIT_POS_19
GCLK_GENCTRL_DIVSEL						EQU BIT_POS_20
GCLK_GENCTRL_RUNSTDBY					EQU BIT_POS_21

GCLK_GENDIV_ID								EQU	0x0
GCLK_GENDIV_ID_Pos						EQU 0
GCLK_GENDIV_DIV								EQU 0x00
GCLK_GENDIV_DIV_Pos						EQU	8
	









PM_CTRL_offset								EQU 0x00
PM_SLEEP_offsef								EQU 0x01
PM_CPUSEL_offsef							EQU 0x08
PM_APBASEL_offsef							EQU 0x09
PM_APBBSEL_offsef							EQU 0x0a
PM_APBCSEL_offsef							EQU 0x0b
PM_AHBMASK_offset							EQU 0x14
PM_APBAMASK_offsef						EQU 0x18
PM_APBBMASK_offsef						EQU 0x1c
PM_APBCMASK_offsef						EQU 0x20
PM_INTENCLR_offsef						EQU 0x34
PM_INTENSET_offsef						EQU 0x35
PM_INTFLAG_offsef							EQU 0x36
PM_RCAUSE_offsef							EQU 0x38
	
PM_CTRL												EQU PM + PM_CTRL_offset
PM_SLEEP											EQU PM + PM_SLEEP_offsef
PM_CPUSEL											EQU PM + PM_CPUSEL_offsef
PM_APBASEL										EQU PM + PM_APBASEL_offsef
PM_APBBSEL										EQU PM + PM_APBBSEL_offsef
PM_APBCSEL										EQU PM + PM_APBCSEL_offsef
PM_AHBMASK										EQU PM + PM_AHBMASK_offset
PM_APBAMASK										EQU PM + PM_APBAMASK_offsef
PM_APBBMASK										EQU PM + PM_APBBMASK_offsef
PM_APBCMASK										EQU PM + PM_APBCMASK_offsef
PM_INTENCLR										EQU PM + PM_INTENCLR_offsef
PM_INTENSET										EQU PM + PM_INTENSET_offsef
PM_INTFLAG										EQU PM + PM_INTFLAG_offsef
PM_RCAUSE											EQU PM + PM_RCAUSE_offsef

;PM_CTRL												EQU 0x00

PM_SLEEP_IDLE_CPU           	EQU BIT_POS_0
PM_SLEEP_IDLE_AHB           	EQU BIT_POS_1
PM_SLEEP_IDLE_APB           	EQU BIT_POS_2

PM_CPUSEL_CPUDIV_DIV1       	EQU BIT_POS_0
PM_CPUSEL_CPUDIV_DIV2       	EQU BIT_POS_1
PM_CPUSEL_CPUDIV_DIV4       	EQU BIT_POS_2
PM_CPUSEL_CPUDIV_DIV8       	EQU BIT_POS_3
PM_CPUSEL_CPUDIV_DIV16      	EQU BIT_POS_4
PM_CPUSEL_CPUDIV_DIV32      	EQU BIT_POS_5
PM_CPUSEL_CPUDIV_DIV64      	EQU BIT_POS_6
PM_CPUSEL_CPUDIV_DIV128     	EQU BIT_POS_7

PM_APBASEL_APBADIV_DIV1		    EQU BIT_POS_0
PM_APBASEL_APBADIV_DIV2   		EQU BIT_POS_1
PM_APBASEL_APBADIV_DIV4   	  EQU BIT_POS_2
PM_APBASEL_APBADIV_DIV8   	  EQU BIT_POS_3
PM_APBASEL_APBADIV_DIV16      EQU BIT_POS_4
PM_APBASEL_APBADIV_DIV32      EQU BIT_POS_5
PM_APBASEL_APBADIV_DIV64      EQU BIT_POS_6
PM_APBASEL_APBADIV_DIV128     EQU BIT_POS_7

PM_APBBSEL_APBADIV_DIV1		    EQU BIT_POS_0
PM_APBBSEL_APBADIV_DIV2   		EQU BIT_POS_1
PM_APBBSEL_APBADIV_DIV4   	  EQU BIT_POS_2
PM_APBBSEL_APBADIV_DIV8   	  EQU BIT_POS_3
PM_APBBSEL_APBADIV_DIV16      EQU BIT_POS_4
PM_APBBSEL_APBADIV_DIV32      EQU BIT_POS_5
PM_APBBSEL_APBADIV_DIV64      EQU BIT_POS_6
PM_APBBSEL_APBADIV_DIV128     EQU BIT_POS_7

PM_APBCSEL_APBADIV_DIV1		    EQU BIT_POS_0
PM_APBCSEL_APBADIV_DIV2   		EQU BIT_POS_1
PM_APBCSEL_APBADIV_DIV4   	  EQU BIT_POS_2
PM_APBCSEL_APBADIV_DIV8   	  EQU BIT_POS_3
PM_APBCSEL_APBADIV_DIV16      EQU BIT_POS_4
PM_APBCSEL_APBADIV_DIV32      EQU BIT_POS_5
PM_APBCSEL_APBADIV_DIV64      EQU BIT_POS_6
PM_APBCSEL_APBADIV_DIV128     EQU BIT_POS_7

PM_AHBMASK_HPB0								EQU BIT_POS_0
PM_AHBMASK_HPB1								EQU BIT_POS_1
PM_AHBMASK_HPB2								EQU BIT_POS_2
PM_AHBMASK_DSU								EQU BIT_POS_3
PM_AHBMASK_NVMCTRL						EQU BIT_POS_4
PM_AHBMASK_DMAC								EQU BIT_POS_5
PM_AHBMASK_USB								EQU BIT_POS_6
	
