zoosmand/SAMD21G18A_eic/inc/samd21g18a.inc
PM_APBAMASK_PAC0							EQU BIT_POS_0
PM_APBAMASK_PM								EQU BIT_POS_1
PM_APBAMASK_SYSCTRL						EQU BIT_POS_2
PM_APBAMASK_GCLK							EQU BIT_POS_3
PM_APBAMASK_WDT								EQU BIT_POS_4
PM_APBAMASK_RTC								EQU BIT_POS_5
PM_APBAMASK_EIC								EQU BIT_POS_6

PM_APBBMASK_PAC1							EQU BIT_POS_0
PM_APBBMASK_DSU								EQU BIT_POS_1
PM_APBBMASK_NVMCTRL						EQU BIT_POS_2
PM_APBBMASK_PORT							EQU BIT_POS_3
PM_APBBMASK_DMAC							EQU BIT_POS_4
PM_APBBMASK_USB								EQU BIT_POS_5
PM_APBBMASK_HMATRIX						EQU BIT_POS_6

PM_APBCMASK_PAC2							EQU BIT_POS_0
PM_APBCMASK_EVSYS							EQU BIT_POS_1
PM_APBCMASK_SERCOM0						EQU BIT_POS_2
PM_APBCMASK_SERCOM1						EQU BIT_POS_3
PM_APBCMASK_SERCOM2						EQU BIT_POS_4
PM_APBCMASK_SERCOM3						EQU BIT_POS_5
PM_APBCMASK_SERCOM4						EQU BIT_POS_6
PM_APBCMASK_SERCOM5						EQU BIT_POS_7
PM_APBCMASK_TCC0							EQU BIT_POS_8
PM_APBCMASK_TCC1							EQU BIT_POS_9
PM_APBCMASK_TCC2							EQU BIT_POS_10
PM_APBCMASK_TC3								EQU BIT_POS_11
PM_APBCMASK_TC4								EQU BIT_POS_12
PM_APBCMASK_TC5								EQU BIT_POS_13
PM_APBCMASK_ADC								EQU BIT_POS_16
PM_APBCMASK_AC								EQU BIT_POS_17
PM_APBCMASK_DAC								EQU BIT_POS_18
PM_APBCMASK_PTC								EQU BIT_POS_19
PM_APBCMASK_I2S								EQU BIT_POS_20

PM_INTENCLR_CKRDY							EQU BIT_POS_0

PM_INTENSET_CKRDY							EQU BIT_POS_0

PM_INTENFLAG_CKRDY						EQU BIT_POS_0

PM_RCAUSE_POR									EQU BIT_POS_0
PM_RCAUSE_BOD12								EQU BIT_POS_1
PM_RCAUSE_BOD33								EQU BIT_POS_2
PM_RCAUSE_EXT									EQU BIT_POS_4
PM_RCAUSE_WDT									EQU BIT_POS_5
PM_RCAUSE_SYST								EQU BIT_POS_6










TC_CTRLA_offset								EQU 0x00
TC_READREQ_offset							EQU 0x02
TC_CTRLBCLR_offset						EQU 0x04
TC_CTRLBSET_offset						EQU 0x05
TC_CTRLC_offset								EQU 0x06
TC_DBGCTRL_offset							EQU 0x08
TC_EVCTRL_offset							EQU 0x0a
TC_INTENCLR_offset						EQU 0x0c
TC_INTENSET_offset						EQU 0x0d
TC_INTFLAG_offset							EQU 0x0e
TC_STATUS_offset							EQU 0x0f
TC_COUNT16_COUNT_offset				EQU 0x10
TC_COUNT16_CC0_offset					EQU 0x18
TC_COUNT16_CC1_offset					EQU 0x1a
TC_COUNT32_COUNT_offset				EQU 0x10
TC_COUNT32_CC0_offset					EQU 0x18
TC_COUNT32_CC1_offset					EQU 0x1c
TC_COUNT8_COUNT_offset				EQU 0x10
TC_COUNT8_PER_offset					EQU 0x14
TC_COUNT8_CC0_offset					EQU 0x18
TC_COUNT8_CC1_offset					EQU 0x19

TC3_CTRLA											EQU TC3 + TC_CTRLA_offset
TC3_READREQ										EQU TC3 + TC_READREQ_offset
TC3_CTRLBCLR									EQU TC3 + TC_CTRLBCLR_offset
TC3_CTRLBSET									EQU TC3 + TC_CTRLBSET_offset
TC3_CTRLC											EQU TC3 + TC_CTRLC_offset
TC3_DBGCTRL										EQU TC3 + TC_DBGCTRL_offset
TC3_EVCTRL										EQU TC3 + TC_EVCTRL_offset
TC3_INTENCLR									EQU TC3 + TC_INTENCLR_offset
TC3_INTENSET									EQU TC3 + TC_INTENSET_offset
TC3_INTFLAG										EQU TC3 + TC_INTFLAG_offset
TC3_STATUS										EQU TC3 + TC_STATUS_offset
TC3_COUNT16_COUNT							EQU TC3 + TC_COUNT16_COUNT_offset
TC3_COUNT16_CC0								EQU TC3 + TC_COUNT16_CC0_offset
TC3_COUNT16_CC1								EQU TC3 + TC_COUNT16_CC1_offset
TC3_COUNT32_COUNT							EQU TC3 + TC_COUNT32_COUNT_offset
TC3_COUNT32_CC0								EQU TC3 + TC_COUNT32_CC0_offset
TC3_COUNT32_CC1								EQU TC3 + TC_COUNT32_CC1_offset
TC3_COUNT8_COUNT							EQU TC3 + TC_COUNT8_COUNT_offset
TC3_COUNT8_PER								EQU TC3 + TC_COUNT8_PER_offset
TC3_COUNT8_CC0								EQU TC3 + TC_COUNT8_CC0_offset
TC3_COUNT8_CC1								EQU TC3 + TC_COUNT8_CC1_offset

TC4_CTRLA											EQU TC4 + TC_CTRLA_offset
TC4_READREQ										EQU TC4 + TC_READREQ_offset
TC4_CTRLBCLR									EQU TC4 + TC_CTRLBCLR_offset
TC4_CTRLBSET									EQU TC4 + TC_CTRLBSET_offset
TC4_CTRLC											EQU TC4 + TC_CTRLC_offset
TC4_DBGCTRL										EQU TC4 + TC_DBGCTRL_offset
TC4_EVCTRL										EQU TC4 + TC_EVCTRL_offset
TC4_INTENCLR									EQU TC4 + TC_INTENCLR_offset
TC4_INTENSET									EQU TC4 + TC_INTENSET_offset
TC4_INTFLAG										EQU TC4 + TC_INTFLAG_offset
TC4_STATUS										EQU TC4 + TC_STATUS_offset
TC4_COUNT16_COUNT							EQU TC4 + TC_COUNT16_COUNT_offset
TC4_COUNT16_CC0								EQU TC4 + TC_COUNT16_CC0_offset
TC4_COUNT16_CC1								EQU TC4 + TC_COUNT16_CC1_offset
TC4_COUNT32_COUNT							EQU TC4 + TC_COUNT32_COUNT_offset
TC4_COUNT32_CC0								EQU TC4 + TC_COUNT32_CC0_offset
TC4_COUNT32_CC1								EQU TC4 + TC_COUNT32_CC1_offset
TC4_COUNT8_COUNT							EQU TC4 + TC_COUNT8_COUNT_offset
TC4_COUNT8_PER								EQU TC4 + TC_COUNT8_PER_offset
TC4_COUNT8_CC0								EQU TC4 + TC_COUNT8_CC0_offset
TC4_COUNT8_CC1								EQU TC4 + TC_COUNT8_CC1_offset

TC5_CTRLA											EQU TC5 + TC_CTRLA_offset
TC5_READREQ										EQU TC5 + TC_READREQ_offset
TC5_CTRLBCLR									EQU TC5 + TC_CTRLBCLR_offset
TC5_CTRLBSET									EQU TC5 + TC_CTRLBSET_offset
TC5_CTRLC											EQU TC5 + TC_CTRLC_offset
TC5_DBGCTRL										EQU TC5 + TC_DBGCTRL_offset
TC5_EVCTRL										EQU TC5 + TC_EVCTRL_offset
TC5_INTENCLR									EQU TC5 + TC_INTENCLR_offset
TC5_INTENSET									EQU TC5 + TC_INTENSET_offset
TC5_INTFLAG										EQU TC5 + TC_INTFLAG_offset
TC5_STATUS										EQU TC5 + TC_STATUS_offset
TC5_COUNT16_COUNT							EQU TC5 + TC_COUNT16_COUNT_offset
TC5_COUNT16_CC0								EQU TC5 + TC_COUNT16_CC0_offset
TC5_COUNT16_CC1								EQU TC5 + TC_COUNT16_CC1_offset
TC5_COUNT32_COUNT							EQU TC5 + TC_COUNT32_COUNT_offset
TC5_COUNT32_CC0								EQU TC5 + TC_COUNT32_CC0_offset
TC5_COUNT32_CC1								EQU TC5 + TC_COUNT32_CC1_offset
TC5_COUNT8_COUNT							EQU TC5 + TC_COUNT8_COUNT_offset
TC5_COUNT8_PER								EQU TC5 + TC_COUNT8_PER_offset
TC5_COUNT8_CC0								EQU TC5 + TC_COUNT8_CC0_offset
TC5_COUNT8_CC1								EQU TC5 + TC_COUNT8_CC1_offset

TC_CTRLA_SWRST								EQU BIT_POS_0
TC_CTRLA_ENABLE								EQU BIT_POS_1
TC_CTRLA_MODE_COUNT16					EQU 0x00
TC_CTRLA_MODE_COUNT8					EQU 0x04
TC_CTRLA_MODE_COUNT32					EQU 0x08
TC_CTRLA_WAVEGEN_NFRQ					EQU 0x00
TC_CTRLA_WAVEGEN_MFRQ					EQU 0x20
TC_CTRLA_WAVEGEN_NPWM					EQU 0x40
TC_CTRLA_WAVEGEN_MPWM					EQU 0x60
TC_CTRLA_PRESCALER_DIV1				EQU 0x0000
TC_CTRLA_PRESCALER_DIV2				EQU 0x0100
TC_CTRLA_PRESCALER_DIV4				EQU 0x0200
TC_CTRLA_PRESCALER_DIV8				EQU 0x0300
TC_CTRLA_PRESCALER_DIV16			EQU 0x0400
TC_CTRLA_PRESCALER_DIV64			EQU 0x0500
TC_CTRLA_PRESCALER_DIV256			EQU 0x0600
TC_CTRLA_PRESCALER_DIV1024		EQU 0x0700
TC_CTRLA_RUNSTDBY							EQU BIT_POS_11
TC_CTRLA_PRESCSYNC_GCLK				EQU 0x0000
TC_CTRLA_PRESCSYNC_PRESC			EQU 0x1000
TC_CTRLA_PRESCSYNC_RESYNC			EQU 0x2000

