zoosmand/SAMD21G18A_eic/inc/samd21g18a.inc
TC_READREQ_ADDR								EQU 0x0
TC_READREQ_RCONT							EQU BIT_POS_14
TC_READREQ_RREQ								EQU BIT_POS_15

TC_CTRLBCLR_DIR								EQU BIT_POS_0
TC_CTRLBCLR_ONESHOT						EQU BIT_POS_2
TC_CTRLBCLR_CMD_NONE					EQU 0x00
TC_CTRLBCLR_CMD_RETRIGGER			EQU 0x40
TC_CTRLBCLR_CMD_STOP					EQU 0x80

TC_CTRLBSET_DIR								EQU BIT_POS_0
TC_CTRLBSET_ONESHOT						EQU BIT_POS_2
TC_CTRLBSET_CMD_NONE					EQU 0x00
TC_CTRLBSET_CMD_RETRIGGER			EQU 0x40
TC_CTRLBSET_CMD_STOP					EQU 0x80

TC_CTRLC_INVEN0								EQU BIT_POS_0
TC_CTRLC_INVEN1								EQU BIT_POS_1
TC_CTRLC_CPTEN0								EQU BIT_POS_4
TC_CTRLC_CPTEN1								EQU BIT_POS_5

TC_DBGCTRL_DBGRUN							EQU BIT_POS_0

TC_EVCTRL_EVACT_OFF						EQU 0x0
TC_EVCTRL_EVACT_RETRIGGER			EQU 0x1
TC_EVCTRL_EVACT_COUNT					EQU 0x2
TC_EVCTRL_EVACT_START					EQU 0x3
TC_EVCTRL_EVACT_PPW						EQU 0x5
TC_EVCTRL_EVACT_PWP						EQU 0x6
TC_EVCTRL_TCINV								EQU BIT_POS_4
TC_EVCTRL_TCEI								EQU BIT_POS_5
TC_EVCTRL_OVFEO								EQU BIT_POS_8
TC_EVCTRL_MCEO0								EQU BIT_POS_12
TC_EVCTRL_MCEO1								EQU BIT_POS_13

TC_INTENCLR_OVF								EQU BIT_POS_0
TC_INTENCLR_ERR								EQU BIT_POS_1
TC_INTENCLR_SYNCRDY						EQU BIT_POS_3
TC_INTENCLR_MC0								EQU BIT_POS_4
TC_INTENCLR_MC1								EQU BIT_POS_5

TC_INTENSET_OVF								EQU BIT_POS_0
TC_INTENSET_ERR								EQU BIT_POS_1
TC_INTENSET_SYNCRDY						EQU BIT_POS_3
TC_INTENSET_MC0								EQU BIT_POS_4
TC_INTENSET_MC1								EQU BIT_POS_5

TC_INTENFLAG_OVF							EQU BIT_POS_0
TC_INTENFLAG_ERR							EQU BIT_POS_1
TC_INTENFLAG_SYNCRDY					EQU BIT_POS_3
TC_INTENFLAG_MC0							EQU BIT_POS_4
TC_INTENFLAG_MC1							EQU BIT_POS_5

TC_STATUS_STOP								EQU BIT_POS_3
TC_STATUS_STOP_Pos						EQU 3
TC_STATUS_SLAVE								EQU BIT_POS_4
TC_STATUS_SYNCBUSY						EQU BIT_POS_7
TC_STATUS_SYNCBUSY_Pos				EQU 7

TC_COUNT16_COUNT							EQU 0x0000
TC_COUNT16_CC0_CC							EQU 0x0000
TC_COUNT16_CC1_CC							EQU 0x0000

TC_COUNT32_COUNT							EQU 0x00000000
TC_COUNT32_CC0_CC							EQU 0x00000000
TC_COUNT32_CC1_CC							EQU 0x00000000

TC_COUNT8_COUNT								EQU 0x00
TC_COUNT8_PER									EQU 0x00
TC_COUNT8_CC0_CC							EQU 0x00
TC_COUNT8_CC1_CC							EQU 0x00






SYSCTRL_INTENCLR_offset				EQU 0x00
SYSCTRL_INTENSET_offset				EQU 0x04
SYSCTRL_INTFLAG_offset				EQU 0x08
SYSCTRL_PCLKSR_offset					EQU 0x0c
SYSCTRL_XOSC_offset						EQU 0x10
SYSCTRL_XOSC32K_offset				EQU 0x14
SYSCTRL_OSC32K_offset					EQU 0x18
SYSCTRL_OSCULP32K_offset			EQU 0x1c
SYSCTRL_OSC8M_offset					EQU 0x20
SYSCTRL_DFLLCTRL_offset				EQU 0x24
SYSCTRL_DFLLVAL_offset				EQU 0x28
SYSCTRL_DFLLMUL_offset				EQU 0x2c
SYSCTRL_DFLLSYNC_offset				EQU 0x30
SYSCTRL_BOD33_offset					EQU 0x34
SYSCTRL_VREG_offset						EQU 0x3c
SYSCTRL_VREF_offset						EQU 0x40
SYSCTRL_DPLLCTRLA_offset			EQU 0x44
SYSCTRL_DPLLRATIO_offset			EQU 0x48
SYSCTRL_DPLLCTRLB_offset			EQU 0x4c
SYSCTRL_DPLLSTATUS_offset			EQU 0x50
	
SYSCTRL_INTENCLR							EQU SYSCTRL + SYSCTRL_INTENCLR_offset ; /**< \brief EQU SYSCTRL ; Interrupt Enable Clear */
SYSCTRL_INTENSET							EQU SYSCTRL + SYSCTRL_INTENSET_offset ; /**< \brief EQU SYSCTRL ; Interrupt Enable Set */
SYSCTRL_INTFLAG								EQU SYSCTRL + SYSCTRL_INTFLAG_offset ; /**< \brief EQU SYSCTRL ; Interrupt Flag Status and Clear */
SYSCTRL_PCLKSR								EQU SYSCTRL + SYSCTRL_PCLKSR_offset ; /**< \brief EQU SYSCTRL ; Power and Clocks Status */
SYSCTRL_XOSC									EQU SYSCTRL + SYSCTRL_XOSC_offset ; /**< \brief EQU SYSCTRL ; External Multipurpose Crystal Oscillator EQU XOSC ; Control */
SYSCTRL_XOSC32K								EQU SYSCTRL + SYSCTRL_XOSC32K_offset ; /**< \brief EQU SYSCTRL ; 32kHz External Crystal Oscillator EQU XOSC32K ; Control */
SYSCTRL_OSC32K								EQU SYSCTRL + SYSCTRL_OSC32K_offset ; /**< \brief EQU SYSCTRL ; 32kHz Internal Oscillator EQU OSC32K ; Control */
SYSCTRL_OSCULP32K							EQU SYSCTRL + SYSCTRL_OSCULP32K_offset ; /**< \brief EQU SYSCTRL ; 32kHz Ultra Low Power Internal Oscillator EQU OSCULP32K ; Control */
SYSCTRL_OSC8M									EQU SYSCTRL + SYSCTRL_OSC8M_offset ; /**< \brief EQU SYSCTRL ; 8MHz Internal Oscillator EQU OSC8M ; Control */
SYSCTRL_DFLLCTRL							EQU SYSCTRL + SYSCTRL_DFLLCTRL_offset ; /**< \brief EQU SYSCTRL ; DFLL48M Control */
SYSCTRL_DFLLVAL								EQU SYSCTRL + SYSCTRL_DFLLVAL_offset ; /**< \brief EQU SYSCTRL ; DFLL48M Value */
SYSCTRL_DFLLMUL								EQU SYSCTRL + SYSCTRL_DFLLMUL_offset ; /**< \brief EQU SYSCTRL ; DFLL48M Multiplier */
SYSCTRL_DFLLSYNC							EQU SYSCTRL + SYSCTRL_DFLLSYNC_offset ; /**< \brief EQU SYSCTRL ; DFLL48M Synchronization */
SYSCTRL_BOD33									EQU SYSCTRL + SYSCTRL_BOD33_offset ; /**< \brief EQU SYSCTRL ; 3.3V Brown-Out Detector EQU BOD33 ; Control */
SYSCTRL_VREG									EQU SYSCTRL + SYSCTRL_VREG_offset ; /**< \brief EQU SYSCTRL ; Voltage Regulator System EQU VREG ; Control */
SYSCTRL_VREF									EQU SYSCTRL + SYSCTRL_VREF_offset ; /**< \brief EQU SYSCTRL ; Voltage References System EQU VREF ; Control */
SYSCTRL_DPLLCTRLA							EQU SYSCTRL + SYSCTRL_DPLLCTRLA_offset ; /**< \brief EQU SYSCTRL ; DPLL Control A */
SYSCTRL_DPLLRATIO							EQU SYSCTRL + SYSCTRL_DPLLRATIO_offset ; /**< \brief EQU SYSCTRL ; DPLL Ratio Control */
SYSCTRL_DPLLCTRLB							EQU SYSCTRL + SYSCTRL_DPLLCTRLB_offset ; /**< \brief EQU SYSCTRL ; DPLL Control B */
SYSCTRL_DPLLSTATUS						EQU SYSCTRL + SYSCTRL_DPLLSTATUS_offset ; /**< \brief EQU SYSCTRL ; DPLL Status */

SYSCTRL_INTENCLR_XOSCRDY			EQU BIT_POS_0
SYSCTRL_INTENCLR_XOSC32KRDY		EQU BIT_POS_1
SYSCTRL_INTENCLR_OSC32KRDY		EQU BIT_POS_2
SYSCTRL_INTENCLR_OSC8MRDY			EQU BIT_POS_3
SYSCTRL_INTENCLR_DFLLRDY			EQU BIT_POS_4
SYSCTRL_INTENCLR_DFLLOOB			EQU BIT_POS_5
SYSCTRL_INTENCLR_DFLLLCKF			EQU BIT_POS_6
SYSCTRL_INTENCLR_DFLLLCKC			EQU BIT_POS_7
SYSCTRL_INTENCLR_DFLLRCS			EQU BIT_POS_8
SYSCTRL_INTENCLR_BOD33RDY			EQU BIT_POS_9
SYSCTRL_INTENCLR_BOD33DET			EQU BIT_POS_10
SYSCTRL_INTENCLR_BOD33SRDY		EQU BIT_POS_11
SYSCTRL_INTENCLR_DPLLLCKR			EQU BIT_POS_15
SYSCTRL_INTENCLR_DPLLLCKF			EQU BIT_POS_16
SYSCTRL_INTENCLR_DPLLLTO			EQU BIT_POS_17

SYSCTRL_INTENSET_XOSCRDY			EQU BIT_POS_0
SYSCTRL_INTENSET_XOSC32KRDY		EQU BIT_POS_1
SYSCTRL_INTENSET_OSC32KRDY		EQU BIT_POS_2
SYSCTRL_INTENSET_OSC8MRDY			EQU BIT_POS_3
SYSCTRL_INTENSET_DFLLRDY			EQU BIT_POS_4
SYSCTRL_INTENSET_DFLLOOB			EQU BIT_POS_5
SYSCTRL_INTENSET_DFLLLCKF			EQU BIT_POS_6
SYSCTRL_INTENSET_DFLLLCKC			EQU BIT_POS_7
SYSCTRL_INTENSET_DFLLRCS			EQU BIT_POS_8
SYSCTRL_INTENSET_BOD33RDY			EQU BIT_POS_9
SYSCTRL_INTENSET_BOD33DET			EQU BIT_POS_10
SYSCTRL_INTENSET_BOD33SRDY		EQU BIT_POS_11
SYSCTRL_INTENSET_DPLLLCKR			EQU BIT_POS_15
SYSCTRL_INTENSET_DPLLLCKF			EQU BIT_POS_16
SYSCTRL_INTENSET_DPLLLTO			EQU BIT_POS_17

SYSCTRL_INTENFLAG_XOSCRDY			EQU BIT_POS_0
SYSCTRL_INTENFLAG_XOSC32KRDY	EQU BIT_POS_1
SYSCTRL_INTENFLAG_OSC32KRDY		EQU BIT_POS_2
SYSCTRL_INTENFLAG_OSC8MRDY		EQU BIT_POS_3
SYSCTRL_INTENFLAG_DFLLRDY			EQU BIT_POS_4
SYSCTRL_INTENFLAG_DFLLOOB			EQU BIT_POS_5
SYSCTRL_INTENFLAG_DFLLLCKF		EQU BIT_POS_6
SYSCTRL_INTENFLAG_DFLLLCKC		EQU BIT_POS_7
SYSCTRL_INTENFLAG_DFLLRCS			EQU BIT_POS_8
SYSCTRL_INTENFLAG_BOD33RDY		EQU BIT_POS_9
SYSCTRL_INTENFLAG_BOD33DET		EQU BIT_POS_10
SYSCTRL_INTENFLAG_BOD33SRDY		EQU BIT_POS_11
SYSCTRL_INTENFLAG_DPLLLCKR		EQU BIT_POS_15
SYSCTRL_INTENFLAG_DPLLLCKF		EQU BIT_POS_16
SYSCTRL_INTENFLAG_DPLLLTO			EQU BIT_POS_17

