zoosmand/SAMD21G18A_eic/inc/samd21g18a.inc
SYSCTRL_PCLKSR_XOSCRDY				EQU BIT_POS_0
SYSCTRL_PCLKSR_XOSC32KRDY			EQU BIT_POS_1
SYSCTRL_PCLKSR_OSC32KRDY			EQU BIT_POS_2
SYSCTRL_PCLKSR_OSC8MRDY				EQU BIT_POS_3
SYSCTRL_PCLKSR_DFLLRDY				EQU BIT_POS_4
SYSCTRL_PCLKSR_DFLLOOB				EQU BIT_POS_5
SYSCTRL_PCLKSR_DFLLLCKF				EQU BIT_POS_6
SYSCTRL_PCLKSR_DFLLLCKC				EQU BIT_POS_7
SYSCTRL_PCLKSR_DFLLRCS				EQU BIT_POS_8
SYSCTRL_PCLKSR_BOD33RDY				EQU BIT_POS_9
SYSCTRL_PCLKSR_BOD33DET				EQU BIT_POS_10
SYSCTRL_PCLKSR_BOD33SRDY			EQU BIT_POS_11
SYSCTRL_PCLKSR_DPLLLCKR				EQU BIT_POS_15
SYSCTRL_PCLKSR_DPLLLCKF				EQU BIT_POS_16
SYSCTRL_PCLKSR_DPLLLTO				EQU BIT_POS_17

SYSCTRL_PCLKSR_XOSCRDY_Pos		EQU 0
SYSCTRL_PCLKSR_XOSC32KRDY_Pos	EQU 1
SYSCTRL_PCLKSR_OSC32KRDY_Pos	EQU 2
SYSCTRL_PCLKSR_OSC8MRDY_Pos		EQU 3
SYSCTRL_PCLKSR_DFLLRDY_Pos		EQU 4
SYSCTRL_PCLKSR_DFLLOOB_Pos		EQU 5
SYSCTRL_PCLKSR_DFLLLCKF_Pos		EQU 6
SYSCTRL_PCLKSR_DFLLLCKC_Pos		EQU 7
SYSCTRL_PCLKSR_DFLLRCS_Pos		EQU 8
SYSCTRL_PCLKSR_BOD33RDY_Pos		EQU 9
SYSCTRL_PCLKSR_BOD33DET_Pos		EQU 10
SYSCTRL_PCLKSR_BOD33SRDY_Pos	EQU 11
SYSCTRL_PCLKSR_DPLLLCKR_Pos		EQU 15
SYSCTRL_PCLKSR_DPLLLCKF_Pos		EQU 16
SYSCTRL_PCLKSR_DPLLLTO_Pos		EQU 17

SYSCTRL_XOSC_ENABLE						EQU BIT_POS_1
SYSCTRL_XOSC_XTALEN						EQU BIT_POS_2
SYSCTRL_XOSC_RUNSTDBY					EQU BIT_POS_6
SYSCTRL_XOSC_ONDEMAND					EQU BIT_POS_7
SYSCTRL_XOSC_GAIN_2M					EQU 0x0000 ; 2MHz
SYSCTRL_XOSC_GAIN_4M					EQU 0x0100 ; 4MHz
SYSCTRL_XOSC_GAIN_8M					EQU 0x0200 ; 8MHz
SYSCTRL_XOSC_GAIN_16M					EQU 0x0300 ; 16MHz
SYSCTRL_XOSC_GAIN_30M					EQU 0x0400 ; 30MHz
SYSCTRL_XOSC_GAIN_5						EQU 0x0500
SYSCTRL_XOSC_GAIN_6						EQU 0x0600
SYSCTRL_XOSC_GAIN_7						EQU 0x0700
SYSCTRL_XOSC_AMPGC						EQU BIT_POS_11
SYSCTRL_XOSC_STARTUP					EQU 0x0
SYSCTRL_XOSC_STARTUP_Pos			EQU 12

SYSCTRL_XOSC32K_ENABLE				EQU BIT_POS_1
SYSCTRL_XOSC32K_XTALEN				EQU BIT_POS_2
SYSCTRL_XOSC32K_EN32K					EQU BIT_POS_3
SYSCTRL_XOSC32K_EN1K					EQU BIT_POS_4
SYSCTRL_XOSC32K_AAMPEN				EQU BIT_POS_5
SYSCTRL_XOSC32K_RUNSTDBY			EQU BIT_POS_6
SYSCTRL_XOSC32K_ONDEMAND			EQU BIT_POS_7
SYSCTRL_XOSC32K_STARTUP				EQU 0x0
SYSCTRL_XOSC32K_STARTUP_Pos		EQU 8
SYSCTRL_XOSC32K_WRTLOCK				EQU BIT_POS_12

SYSCTRL_OSC32K_ENABLE					EQU BIT_POS_1
SYSCTRL_OSC32K_EN32K					EQU BIT_POS_2
SYSCTRL_OSC32K_EN1K						EQU BIT_POS_3
SYSCTRL_OSC32K_RUNSTDBY				EQU BIT_POS_6
SYSCTRL_OSC32K_ONDEMAND				EQU BIT_POS_7
SYSCTRL_OSC32K_STARTUP				EQU 0x0
SYSCTRL_OSC32K_STARTUP_Pos		EQU 8
SYSCTRL_OSC32K_WRTLOCK				EQU BIT_POS_12
SYSCTRL_OSC32K_CALIB					EQU 0x00
SYSCTRL_OSC32K_CALIB_Pos			EQU 16

SYSCTRL_OSCULP32K_CALIB				EQU 0x0
SYSCTRL_OSCULP32K_CALIB_Pos		EQU 0
SYSCTRL_OSCULP32K_WRTLOCK			EQU BIT_POS_7

SYSCTRL_OSC8M_ENABLE					EQU BIT_POS_1
SYSCTRL_OSC8M_RUNSTDBY				EQU BIT_POS_6
SYSCTRL_OSC8M_ONDEMAND				EQU BIT_POS_7
SYSCTRL_OSC8M_PRESC_1					EQU 0x0000 ; 1
SYSCTRL_OSC8M_PRESC_2					EQU 0x0100 ; 2
SYSCTRL_OSC8M_PRESC_4					EQU 0x0200 ; 4
SYSCTRL_OSC8M_PRESC_8					EQU 0x0300 ; 8
SYSCTRL_OSC8M_PRESC_MASK			EQU 0xffff00ff
SYSCTRL_OSC8M_CALIB						EQU 0x0000
SYSCTRL_OSC8M_CALIB_Pos				EQU 16
SYSCTRL_OSC8M_FRANGE_4_6			EQU 0x00000000 ; 4 - 6 MHz
SYSCTRL_OSC8M_FRANGE_6_8			EQU 0x40000000 ; 6 - 8 MHz
SYSCTRL_OSC8M_FRANGE_8_11			EQU 0x80000000 ; 8 - 11 MHz
SYSCTRL_OSC8M_FRANGE_11_16		EQU 0xc0000000 ; 11 - 16 MHz

SYSCTRL_DFLLCTRL_ENABLE				EQU BIT_POS_1
SYSCTRL_DFLLCTRL_MODE					EQU BIT_POS_2
SYSCTRL_DFLLCTRL_STABLE				EQU BIT_POS_3
SYSCTRL_DFLLCTRL_LLAW					EQU BIT_POS_4
SYSCTRL_DFLLCTRL_USBCRM				EQU BIT_POS_5
SYSCTRL_DFLLCTRL_RUNSTDBY			EQU BIT_POS_6
SYSCTRL_DFLLCTRL_ONDEMAND			EQU BIT_POS_7
SYSCTRL_DFLLCTRL_CCDIS				EQU BIT_POS_8
SYSCTRL_DFLLCTRL_QLDIS				EQU BIT_POS_9
SYSCTRL_DFLLCTRL_BPLCKC				EQU BIT_POS_10
SYSCTRL_DFLLCTRL_WAITLOCK			EQU BIT_POS_11

SYSCTRL_DFLLVAL_FINE					EQU 0x000000
SYSCTRL_DFLLVAL_FINE_Pos			EQU 0
SYSCTRL_DFLLVAL_COARSE				EQU 0x000
SYSCTRL_DFLLVAL_COARSE_Pos		EQU 10
SYSCTRL_DFLLVAL_DIFF					EQU 0x000000
SYSCTRL_DFLLVAL_DIFF_Pos			EQU 16

SYSCTRL_DFLLMUL_MUL						EQU 0x0000
SYSCTRL_DFLLMUL_MUL_Pos				EQU 0
SYSCTRL_DFLLMUL_FSTEP					EQU 0x000
SYSCTRL_DFLLMUL_FSTEP_Pos			EQU 16
SYSCTRL_DFLLMUL_CSTEP					EQU 0x00
SYSCTRL_DFLLMUL_CSTEP_Pos			EQU 26

SYSCTRL_DFLLSYNC_READREQ			EQU	BIT_POS_7

SYSCTRL_BOD33_ENABLE					EQU BIT_POS_1
SYSCTRL_BOD33_HYST						EQU BIT_POS_2
SYSCTRL_BOD33_ACTION_NONE			EQU 0x00
SYSCTRL_BOD33_ACTION_RESET		EQU 0x08
SYSCTRL_BOD33_ACTION_INTERRUPT	EQU 0x10
SYSCTRL_BOD33_ACTION_3				EQU 0x18
SYSCTRL_BOD33_RUNSTDBY				EQU BIT_POS_6
SYSCTRL_BOD33_MODE						EQU BIT_POS_8
SYSCTRL_BOD33_CEN							EQU BIT_POS_9
SYSCTRL_BOD33_PSEL_2					EQU 0x0000 ; 2
SYSCTRL_BOD33_PSEL_4					EQU 0x1000 ; 4
SYSCTRL_BOD33_PSEL_8					EQU 0x2000 ; 8
SYSCTRL_BOD33_PSEL_16					EQU 0x3000 ; 16
SYSCTRL_BOD33_PSEL_32					EQU 0x4000 ; 32
SYSCTRL_BOD33_PSEL_64					EQU 0x5000 ; 64
SYSCTRL_BOD33_PSEL_128				EQU 0x6000 ; 128
SYSCTRL_BOD33_PSEL_256				EQU 0x7000 ; 256
SYSCTRL_BOD33_PSEL_512				EQU 0x8000 ; 512
SYSCTRL_BOD33_PSEL_1024				EQU 0x9000 ; 1024
SYSCTRL_BOD33_PSEL_2048				EQU 0xa000 ; 2048
SYSCTRL_BOD33_PSEL_4096				EQU 0xb000 ; 4096
SYSCTRL_BOD33_PSEL_8192				EQU 0xc000 ; 8192
SYSCTRL_BOD33_PSEL_16384			EQU 0xd000 ; 16384
SYSCTRL_BOD33_PSEL_32768			EQU 0xe000 ; 32768
SYSCTRL_BOD33_PSEL_65536			EQU 0xf000 ; 65536
SYSCTRL_BOD33_LEVEL						EQU 0x000
SYSCTRL_BOD33_LEVEL_Pos				EQU 16

SYSCTRL_VREG_RUNSTDBY					EQU BIT_POS_6
SYSCTRL_VREG_FORCELDO					EQU BIT_POS_13

SYSCTRL_VREF_TSEN							EQU BIT_POS_1
SYSCTRL_VREF_BGOUTEN					EQU BIT_POS_2
SYSCTRL_VREF_CALIB						EQU 0x000
SYSCTRL_VREF_CALIB_Pos				EQU 16

SYSCTRL_DPLLCTRLA_ENABLE			EQU	BIT_POS_1
SYSCTRL_DPLLCTRLA_RUNSTDBY		EQU	BIT_POS_6
SYSCTRL_DPLLCTRLA_ONDEMAND		EQU	BIT_POS_7

SYSCTRL_DPLLRATIO_LDR					EQU 0x00
SYSCTRL_DPLLRATIO_LDR_Pos			EQU 0
SYSCTRL_DPLLRATIO_LDRFRAC			EQU 0x0
SYSCTRL_DPLLRATIO_LDRFRAC_Pos	EQU 16

SYSCTRL_DPLLCTRLB_FILTER_DEFAULT	EQU 0x0
SYSCTRL_DPLLCTRLB_FILTER_LBFILT		EQU 0x1
SYSCTRL_DPLLCTRLB_FILTER_HBFILT		EQU 0x2
SYSCTRL_DPLLCTRLB_FILTER_HDFILT		EQU 0x3
SYSCTRL_DPLLCTRLB_LPEN				EQU BIT_POS_2
SYSCTRL_DPLLCTRLB_WUF					EQU BIT_POS_3
SYSCTRL_DPLLCTRLB_REFCLK_REF0	EQU 0x00
SYSCTRL_DPLLCTRLB_REFCLK_REF1	EQU 0x10
SYSCTRL_DPLLCTRLB_REFCLK_GCLK	EQU 0x20
SYSCTRL_DPLLCTRLB_REFCLK_3		EQU 0x30
SYSCTRL_DPLLCTRLB_DEFAULT			EQU	0x0000
SYSCTRL_DPLLCTRLB_1						EQU	0x0100
SYSCTRL_DPLLCTRLB_2						EQU	0x0200
SYSCTRL_DPLLCTRLB_3						EQU	0x0300
SYSCTRL_DPLLCTRLB_8MS					EQU	0x0400
SYSCTRL_DPLLCTRLB_9MS					EQU	0x0500
SYSCTRL_DPLLCTRLB_10MS				EQU	0x0600
SYSCTRL_DPLLCTRLB_11MS				EQU	0x0700
SYSCTRL_DPLLCTRLB_LBYPASS			EQU BIT_POS_12
SYSCTRL_DPLLCTRLB_DIV					EQU 0x000
SYSCTRL_DPLLCTRLB_DIV_Pos			EQU 16

SYSCTRL_DPLLSTATUS_LOCK				EQU BIT_POS_0
SYSCTRL_DPLLSTATUS_CLKRDY			EQU BIT_POS_1
SYSCTRL_DPLLSTATUS_ENABLE			EQU BIT_POS_2
SYSCTRL_DPLLSTATUS_DIV				EQU BIT_POS_3





WDT_CTRL_offset								EQU 0x00
WDT_CONFIG_offset							EQU 0x01
WDT_EWCTRL_offset							EQU 0x02
WDT_INTENCLR_offset						EQU 0x04
WDT_INTENSET_offset						EQU 0x05
WDT_INTFLAG_offset						EQU 0x06
WDT_STATUS_offset							EQU 0x07
WDT_CLEAR_offset							EQU 0x08

WDT_CTRL											EQU WDT + WDT_CTRL_offset
WDT_CONFIG										EQU WDT + WDT_CONFIG_offset
WDT_EWCTRL										EQU WDT + WDT_EWCTRL_offset
WDT_INTENCLR									EQU WDT + WDT_INTENCLR_offset
WDT_INTENSET									EQU WDT + WDT_INTENSET_offset
WDT_INTFLAG										EQU WDT + WDT_INTFLAG_offset
WDT_STATUS										EQU WDT + WDT_STATUS_offset
WDT_CLEAR											EQU WDT + WDT_CLEAR_offset

WDT_CTRL_ENABLE								EQU BIT_POS_1
WDT_CTRL_WEN									EQU BIT_POS_2
WDT_CTRL_ALWAYSON							EQU BIT_POS_7

