zoosmand/SAMD21G18A_eic/inc/samd21g18a.inc
WDT_CONFIG_PER_8							EQU 0x00
WDT_CONFIG_PER_16							EQU 0x01
WDT_CONFIG_PER_32							EQU 0x02
WDT_CONFIG_PER_64							EQU 0x03
WDT_CONFIG_PER_128						EQU 0x04
WDT_CONFIG_PER_256						EQU 0x05
WDT_CONFIG_PER_512						EQU 0x06
WDT_CONFIG_PER_1K							EQU 0x07
WDT_CONFIG_PER_2K							EQU 0x08
WDT_CONFIG_PER_4K							EQU 0x09
WDT_CONFIG_PER_8K							EQU 0x0a
WDT_CONFIG_PER_16K						EQU 0x0b

WDT_CONFIG_WINDOW_8						EQU 0x00
WDT_CONFIG_WINDOW_16					EQU 0x10
WDT_CONFIG_WINDOW_32					EQU 0x20
WDT_CONFIG_WINDOW_64					EQU 0x30
WDT_CONFIG_WINDOW_128					EQU 0x40
WDT_CONFIG_WINDOW_256					EQU 0x50
WDT_CONFIG_WINDOW_512					EQU 0x60
WDT_CONFIG_WINDOW_1K					EQU 0x70
WDT_CONFIG_WINDOW_2K					EQU 0x80
WDT_CONFIG_WINDOW_4K					EQU 0x90
WDT_CONFIG_WINDOW_8K					EQU 0xa0
WDT_CONFIG_WINDOW_16K					EQU 0xb0

WDT_EWCTRL_EWOFFSET_8					EQU 0x00
WDT_EWCTRL_EWOFFSET_16				EQU 0x01
WDT_EWCTRL_EWOFFSET_32				EQU 0x02
WDT_EWCTRL_EWOFFSET_64				EQU 0x03
WDT_EWCTRL_EWOFFSET_128				EQU 0x04
WDT_EWCTRL_EWOFFSET_256				EQU 0x05
WDT_EWCTRL_EWOFFSET_512				EQU 0x06
WDT_EWCTRL_EWOFFSET_1K				EQU 0x07
WDT_EWCTRL_EWOFFSET_2K				EQU 0x08
WDT_EWCTRL_EWOFFSET_4K				EQU 0x09
WDT_EWCTRL_EWOFFSET_8K				EQU 0x0a
WDT_EWCTRL_EWOFFSET_16K				EQU 0x0b

WDT_INTENCLR_EW								EQU BIT_POS_0

WDT_INTENSET_EW								EQU BIT_POS_0

WDT_INTENFLAG_EW							EQU BIT_POS_0

WDT_STATUS_SYNCBUSY						EQU BIT_POS_7
WDT_STATUS_SYNCBUSY_Pos				EQU 7

WDT_CLEAR_CLEAR								EQU 0xa5
WDT_CLEAR_CLEAR_Pos						EQU 0









NVMCTRL_CTRLA_offset					EQU 0x00
NVMCTRL_CTRLB_offset					EQU 0x04
NVMCTRL_PARAM_offset					EQU 0x08
NVMCTRL_INTENCLR_offset				EQU 0x0c
NVMCTRL_INTENSET_offset				EQU 0x10
NVMCTRL_INTFLAG_offset				EQU 0x14
NVMCTRL_STATUS_offset					EQU 0x18
NVMCTRL_ADDR_offset						EQU 0x1c
NVMCTRL_LOCK_offset						EQU 0x20

NVMCTRL_CTRLA									EQU NVMCTRL + NVMCTRL_CTRLA_offset
NVMCTRL_CTRLB									EQU NVMCTRL + NVMCTRL_CTRLB_offset
NVMCTRL_PARAM									EQU NVMCTRL + NVMCTRL_PARAM_offset
NVMCTRL_INTENCLR							EQU NVMCTRL + NVMCTRL_INTENCLR_offset
NVMCTRL_INTENSET							EQU NVMCTRL + NVMCTRL_INTENSET_offset
NVMCTRL_INTFLAG								EQU NVMCTRL + NVMCTRL_INTFLAG_offset
NVMCTRL_STATUS								EQU NVMCTRL + NVMCTRL_STATUS_offset
NVMCTRL_ADDR									EQU NVMCTRL + NVMCTRL_ADDR_offset
NVMCTRL_LOCK									EQU NVMCTRL + NVMCTRL_LOCK_offset

;/* ========== Instance parameters for NVMCTRL peripheral ========== */
;#define NVMCTRL_AUX0_ADDRESS        0x00804000
;#define NVMCTRL_AUX1_ADDRESS        0x00806000
;#define NVMCTRL_AUX2_ADDRESS        0x00808000
;#define NVMCTRL_AUX3_ADDRESS        0x0080A000
;#define NVMCTRL_CLK_AHB_ID          4        // Index of AHB Clock in PM.AHBMASK register
;#define NVMCTRL_FACTORY_WORD_IMPLEMENTED_MASK 0xC0000007FFFFFFFF
;#define NVMCTRL_FLASH_SIZE          262144  
;#define NVMCTRL_LOCKBIT_ADDRESS     0x00802000
;#define NVMCTRL_PAGE_HW             32      
;#define NVMCTRL_PAGE_SIZE           64      
;#define NVMCTRL_PAGE_W              16      
;#define NVMCTRL_PMSB                3       
;#define NVMCTRL_PSZ_BITS            6       
;#define NVMCTRL_ROW_PAGES           4       
;#define NVMCTRL_ROW_SIZE            256     
;#define NVMCTRL_TEMP_LOG_ADDRESS    0x00806030
;#define NVMCTRL_USER_PAGE_ADDRESS   0x00800000
;#define NVMCTRL_USER_PAGE_OFFSET    0x00800000
;#define NVMCTRL_USER_WORD_IMPLEMENTED_MASK 0xC01FFFFFFFFFFFFF

NVMCTRL_CTRLA_CMD							EQU 0x00
NVMCTRL_CTRLA_CMD_Pos					EQU 0
NVMCTRL_CTRLA_CMD_ER					EQU 0x02 ; Erase Row - Erases the row addressed by the ADDR register.
NVMCTRL_CTRLA_CMD_WP					EQU 0x04 ; Write Page - Writes the contents of the page buffer to the page addressed by the ADDR register.
NVMCTRL_CTRLA_CMD_EAR					EQU 0x05 ; Erase Auxiliary Row - Erases the auxiliary row addressed by the ADDR register. This command can be given only when the security bit is not set and only to the user configuration row.
NVMCTRL_CTRLA_CMD_WAP					EQU 0x06 ; Write Auxiliary Page - Writes the contents of the page buffer to the page addressed by the ADDR register. This command can be given only when the security bit is not set and only to the user configuration row.
NVMCTRL_CTRLA_CMD_SF					EQU 0x0a ; Security Flow Command
NVMCTRL_CTRLA_CMD_WL					EQU 0x0f ; Write lockbits
NVMCTRL_CTRLA_CMD_LR					EQU 0x40 ; Lock Region - Locks the region containing the address location in the ADDR register.
NVMCTRL_CTRLA_CMD_UR					EQU 0x41 ; Unlock Region - Unlocks the region containing the address location in the ADDR register.
NVMCTRL_CTRLA_CMD_SPRM				EQU 0x42 ; Sets the power reduction mode.
NVMCTRL_CTRLA_CMD_CPRM				EQU 0x43 ; Clears the power reduction mode.
NVMCTRL_CTRLA_CMD_PBC					EQU 0x44 ; Page Buffer Clear - Clears the page buffer.
NVMCTRL_CTRLA_CMD_SSB					EQU 0x45 ; Set Security Bit - Sets the security bit by writing 0x00 to the first byte in the lockbit row.
NVMCTRL_CTRLA_CMD_INVALL			EQU 0x46 ; Invalidates all cache lines.

NVMCTRL_CTRLA_CMDEX						EQU 0x00
NVMCTRL_CTRLA_CMDEXPos				EQU 8

NVMCTRL_CTRLB_RWS_SINGLE			EQU 0x0
NVMCTRL_CTRLB_RWS_HALF				EQU 0x2
NVMCTRL_CTRLB_RWS_DUAL				EQU 0x4
NVMCTRL_CTRLB_MANW						EQU BIT_POS_7
NVMCTRL_CTRLB_SLEEPPRM_WAKEONACCESS			EQU 0x0000
NVMCTRL_CTRLB_SLEEPPRM_WAKEUPINSTANT		EQU 0x0100
NVMCTRL_CTRLB_SLEEPPRM_DISABLED					EQU 0x0300
NVMCTRL_CTRLB_READMODE_NO_MISS_PENALTY	EQU 0x000000
NVMCTRL_CTRLB_READMODE_LOW_POWER				EQU 0x010000
NVMCTRL_CTRLB_READMODE_DETERMINISTIC		EQU 0x020000
NVMCTRL_CTRLB_CACHEDIS				EQU BIT_POS_18

NVMCTRL_PARAM_PSZ							EQU 0x0000
NVMCTRL_PARAM_PSZ_Pos					EQU 0
NVMCTRL_PARAM_PSZ_8						EQU 0x000000
NVMCTRL_PARAM_PSZ_16					EQU 0x010000
NVMCTRL_PARAM_PSZ_32					EQU 0x020000
NVMCTRL_PARAM_PSZ_64					EQU 0x030000
NVMCTRL_PARAM_PSZ_128					EQU 0x040000
NVMCTRL_PARAM_PSZ_256					EQU 0x050000
NVMCTRL_PARAM_PSZ_512					EQU 0x060000
NVMCTRL_PARAM_PSZ_1024				EQU 0x070000

NVMCTRL_INTENCLR_READY				EQU BIT_POS_0
NVMCTRL_INTENCLR_ERROR				EQU BIT_POS_1

NVMCTRL_INTENSET_READY				EQU BIT_POS_0
NVMCTRL_INTENSET_ERROR				EQU BIT_POS_1

NVMCTRL_INTENFLAG_READY				EQU BIT_POS_0
NVMCTRL_INTENFLAG_ERROR				EQU BIT_POS_1

NVMCTRL_STATUS_PRM						EQU BIT_POS_0
NVMCTRL_STATUS_LOAD						EQU BIT_POS_1
NVMCTRL_STATUS_PROGE					EQU BIT_POS_2
NVMCTRL_STATUS_LOCKE					EQU BIT_POS_3
NVMCTRL_STATUS_NVME						EQU BIT_POS_4
NVMCTRL_STATUS_SB							EQU BIT_POS_8

