zoosmand/SAMD21G18A_eic/inc/samd21g18a.inc
NVMCTRL_ADDR_ADDR							EQU 0x00000000
NVMCTRL_ADDR_ADDR_Pos					EQU 0

NVMCTRL_LOCK_LOCK							EQU 0x0000
NVMCTRL_LOCK_LOCK_Pos					EQU 0









EIC_CTRL_offset								EQU 0x00
EIC_STATUS_offset							EQU 0x01
EIC_NMICTRL_offset						EQU 0x02
EIC_NMIFLAG_offset						EQU 0x03
EIC_EVCTRL_offset							EQU 0x04
EIC_INTENCLR_offset						EQU 0x08
EIC_INTENSET_offset						EQU 0x0c
EIC_INTFLAG_offset					EQU 0x10
EIC_WAKEUP_offset							EQU 0x14
EIC_CONFIG0_offset						EQU 0x18
EIC_CONFIG1_offset						EQU 0x1c

EIC_CTRL_SWRST								EQU BIT_POS_0
EIC_CTRL_ENABLE								EQU BIT_POS_1

EIC_STATUS_SYNCBUSY						EQU BIT_POS_7
EIC_STATUS_SYNCBUSY_Pos				EQU 7

EIC_NMICTRL_NMISENSE_NONE			EQU 0x0
EIC_NMICTRL_NMISENSE_RISE			EQU 0x1
EIC_NMICTRL_NMISENSE_FALL			EQU 0x2
EIC_NMICTRL_NMISENSE_BOTH			EQU 0x3
EIC_NMICTRL_NMISENSE_HIGH			EQU 0x4
EIC_NMICTRL_NMISENSE_LOW			EQU 0x5
EIC_NMICTRL_NMIFILTEN					EQU BIT_POS_3

EIC_NMIFLAG_NMI								EQU BIT_POS_0

EIC_EVCTRL_EXTINTEO0					EQU BIT_POS_0
EIC_EVCTRL_EXTINTEO1					EQU BIT_POS_1
EIC_EVCTRL_EXTINTEO2					EQU BIT_POS_2
EIC_EVCTRL_EXTINTEO3					EQU BIT_POS_3
EIC_EVCTRL_EXTINTEO4					EQU BIT_POS_4
EIC_EVCTRL_EXTINTEO5					EQU BIT_POS_5
EIC_EVCTRL_EXTINTEO6					EQU BIT_POS_6
EIC_EVCTRL_EXTINTEO7					EQU BIT_POS_7
EIC_EVCTRL_EXTINTEO8					EQU BIT_POS_8
EIC_EVCTRL_EXTINTEO9					EQU BIT_POS_9
EIC_EVCTRL_EXTINTEO10					EQU BIT_POS_10
EIC_EVCTRL_EXTINTEO11					EQU BIT_POS_11
EIC_EVCTRL_EXTINTEO12					EQU BIT_POS_12
EIC_EVCTRL_EXTINTEO13					EQU BIT_POS_13
EIC_EVCTRL_EXTINTEO14					EQU BIT_POS_14
EIC_EVCTRL_EXTINTEO15					EQU BIT_POS_15

EIC_INTENCLR_EXTINT0					EQU BIT_POS_0
EIC_INTENCLR_EXTINT1					EQU BIT_POS_1
EIC_INTENCLR_EXTINT2					EQU BIT_POS_2
EIC_INTENCLR_EXTINT3					EQU BIT_POS_3
EIC_INTENCLR_EXTINT4					EQU BIT_POS_4
EIC_INTENCLR_EXTINT5					EQU BIT_POS_5
EIC_INTENCLR_EXTINT6					EQU BIT_POS_6
EIC_INTENCLR_EXTINT7					EQU BIT_POS_7
EIC_INTENCLR_EXTINT8					EQU BIT_POS_8
EIC_INTENCLR_EXTINT9					EQU BIT_POS_9
EIC_INTENCLR_EXTINT10					EQU BIT_POS_10
EIC_INTENCLR_EXTINT11					EQU BIT_POS_11
EIC_INTENCLR_EXTINT12					EQU BIT_POS_12
EIC_INTENCLR_EXTINT13					EQU BIT_POS_13
EIC_INTENCLR_EXTINT14					EQU BIT_POS_14
EIC_INTENCLR_EXTINT15					EQU BIT_POS_15

EIC_INTENSET_EXTINT0					EQU BIT_POS_0
EIC_INTENSET_EXTINT1					EQU BIT_POS_1
EIC_INTENSET_EXTINT2					EQU BIT_POS_2
EIC_INTENSET_EXTINT3					EQU BIT_POS_3
EIC_INTENSET_EXTINT4					EQU BIT_POS_4
EIC_INTENSET_EXTINT5					EQU BIT_POS_5
EIC_INTENSET_EXTINT6					EQU BIT_POS_6
EIC_INTENSET_EXTINT7					EQU BIT_POS_7
EIC_INTENSET_EXTINT8					EQU BIT_POS_8
EIC_INTENSET_EXTINT9					EQU BIT_POS_9
EIC_INTENSET_EXTINT10					EQU BIT_POS_10
EIC_INTENSET_EXTINT11					EQU BIT_POS_11
EIC_INTENSET_EXTINT12					EQU BIT_POS_12
EIC_INTENSET_EXTINT13					EQU BIT_POS_13
EIC_INTENSET_EXTINT14					EQU BIT_POS_14
EIC_INTENSET_EXTINT15					EQU BIT_POS_15

EIC_INTFLAG_EXTINT0						EQU BIT_POS_0
EIC_INTFLAG_EXTINT1						EQU BIT_POS_1
EIC_INTFLAG_EXTINT2						EQU BIT_POS_2
EIC_INTFLAG_EXTINT3						EQU BIT_POS_3
EIC_INTFLAG_EXTINT4						EQU BIT_POS_4
EIC_INTFLAG_EXTINT5						EQU BIT_POS_5
EIC_INTFLAG_EXTINT6						EQU BIT_POS_6
EIC_INTFLAG_EXTINT7						EQU BIT_POS_7
EIC_INTFLAG_EXTINT8						EQU BIT_POS_8
EIC_INTFLAG_EXTINT9						EQU BIT_POS_9
EIC_INTFLAG_EXTINT10					EQU BIT_POS_10
EIC_INTFLAG_EXTINT11					EQU BIT_POS_11
EIC_INTFLAG_EXTINT12					EQU BIT_POS_12
EIC_INTFLAG_EXTINT13					EQU BIT_POS_13
EIC_INTFLAG_EXTINT14					EQU BIT_POS_14
EIC_INTFLAG_EXTINT15					EQU BIT_POS_15

EIC_WAKEUP_WAKEUPEN0					EQU BIT_POS_0
EIC_WAKEUP_WAKEUPEN1					EQU BIT_POS_1
EIC_WAKEUP_WAKEUPEN2					EQU BIT_POS_2
EIC_WAKEUP_WAKEUPEN3					EQU BIT_POS_3
EIC_WAKEUP_WAKEUPEN4					EQU BIT_POS_4
EIC_WAKEUP_WAKEUPEN5					EQU BIT_POS_5
EIC_WAKEUP_WAKEUPEN6					EQU BIT_POS_6
EIC_WAKEUP_WAKEUPEN7					EQU BIT_POS_7
EIC_WAKEUP_WAKEUPEN8					EQU BIT_POS_8
EIC_WAKEUP_WAKEUPEN9					EQU BIT_POS_9
EIC_WAKEUP_WAKEUPEN10					EQU BIT_POS_10
EIC_WAKEUP_WAKEUPEN11					EQU BIT_POS_11
EIC_WAKEUP_WAKEUPEN12					EQU BIT_POS_12
EIC_WAKEUP_WAKEUPEN13					EQU BIT_POS_13
EIC_WAKEUP_WAKEUPEN14					EQU BIT_POS_14
EIC_WAKEUP_WAKEUPEN15					EQU BIT_POS_15

EIC_CONFIG_SENSE0_NONE				EQU 0x0
EIC_CONFIG_SENSE0_RISE				EQU 0x1
EIC_CONFIG_SENSE0_FALL				EQU 0x2
EIC_CONFIG_SENSE0_BOTH				EQU 0x3
EIC_CONFIG_SENSE0_HIGH				EQU 0x4
EIC_CONFIG_SENSE0_LOW					EQU 0x5
EIC_CONFIG_FILTEN0						EQU BIT_POS_3
EIC_CONFIG_SENSE1_NONE				EQU 0x00
EIC_CONFIG_SENSE1_RISE				EQU 0x10
EIC_CONFIG_SENSE1_FALL				EQU 0x20
EIC_CONFIG_SENSE1_BOTH				EQU 0x30
EIC_CONFIG_SENSE1_HIGH				EQU 0x40
EIC_CONFIG_SENSE1_LOW					EQU 0x50
EIC_CONFIG_FILTEN1						EQU BIT_POS_7
EIC_CONFIG_SENSE2_NONE				EQU 0x00
EIC_CONFIG_SENSE2_RISE				EQU 0x100
EIC_CONFIG_SENSE2_FALL				EQU 0x200
EIC_CONFIG_SENSE2_BOTH				EQU 0x300
EIC_CONFIG_SENSE2_HIGH				EQU 0x400
EIC_CONFIG_SENSE2_LOW					EQU 0x500
EIC_CONFIG_FILTEN2						EQU BIT_POS_11
EIC_CONFIG_SENSE3_NONE				EQU 0x0000
EIC_CONFIG_SENSE3_RISE				EQU 0x1000
EIC_CONFIG_SENSE3_FALL				EQU 0x2000
EIC_CONFIG_SENSE3_BOTH				EQU 0x3000
EIC_CONFIG_SENSE3_HIGH				EQU 0x4000
EIC_CONFIG_SENSE3_LOW					EQU 0x5000
EIC_CONFIG_FILTEN3						EQU BIT_POS_15
EIC_CONFIG_SENSE4_NONE				EQU 0x00000
EIC_CONFIG_SENSE4_RISE				EQU 0x10000
EIC_CONFIG_SENSE4_FALL				EQU 0x20000
EIC_CONFIG_SENSE4_BOTH				EQU 0x30000
EIC_CONFIG_SENSE4_HIGH				EQU 0x40000
EIC_CONFIG_SENSE4_LOW					EQU 0x50000
EIC_CONFIG_FILTEN4						EQU BIT_POS_19
EIC_CONFIG_SENSE5_NONE				EQU 0x000000
EIC_CONFIG_SENSE5_RISE				EQU 0x100000
EIC_CONFIG_SENSE5_FALL				EQU 0x200000
EIC_CONFIG_SENSE5_BOTH				EQU 0x300000
EIC_CONFIG_SENSE5_HIGH				EQU 0x400000
EIC_CONFIG_SENSE5_LOW					EQU 0x500000
EIC_CONFIG_FILTEN5						EQU BIT_POS_23
EIC_CONFIG_SENSE6_NONE				EQU 0x0000000
EIC_CONFIG_SENSE6_RISE				EQU 0x1000000
EIC_CONFIG_SENSE6_FALL				EQU 0x2000000
EIC_CONFIG_SENSE6_BOTH				EQU 0x3000000
EIC_CONFIG_SENSE6_HIGH				EQU 0x4000000
EIC_CONFIG_SENSE6_LOW					EQU 0x5000000
EIC_CONFIG_FILTEN6						EQU BIT_POS_27
EIC_CONFIG_SENSE7_NONE				EQU 0x00000000
EIC_CONFIG_SENSE7_RISE				EQU 0x10000000
EIC_CONFIG_SENSE7_FALL				EQU 0x20000000
EIC_CONFIG_SENSE7_BOTH				EQU 0x30000000
EIC_CONFIG_SENSE7_HIGH				EQU 0x40000000
EIC_CONFIG_SENSE7_LOW					EQU 0x50000000
EIC_CONFIG_FILTEN7						EQU BIT_POS_31










;SERCOM_offset									EQU 0x00000400
;SERCOM0												EQU SERCOM
;SERCOM1												EQU SERCOM0 + SERCOM_offset
;SERCOM2												EQU SERCOM1 + SERCOM_offset
;SERCOM3												EQU SERCOM2 + SERCOM_offset
;SERCOM4												EQU SERCOM3 + SERCOM_offset
;SERCOM5												EQU SERCOM4 + SERCOM_offset


; I2CM
I2CM_CTRLA_offset							EQU 0x00
I2CM_CTRLB_offset							EQU 0x04
I2CM_BAUD_offset							EQU 0x0c
I2CM_INTENCLR_offset					EQU 0x14
I2CM_INTENSET_offset					EQU 0x16
I2CM_INTFLAG_offset						EQU 0x18
I2CM_STATUS_offset						EQU 0x1a
I2CM_SYNCBUSY_offset					EQU 0x1c
I2CM_ADDR_offset							EQU 0x24
I2CM_DATA_offset							EQU 0x28
I2CM_DBGCTRL_offset						EQU 0x30

I2CM0_CTRLA										EQU SERCOM0 + I2CM_CTRLA_offset
I2CM0_CTRLB										EQU SERCOM0 + I2CM_CTRLB_offset
I2CM0_BAUD										EQU SERCOM0 + I2CM_BAUD_offset
I2CM0_INTENCLR								EQU SERCOM0 + I2CM_INTENCLR_offset
I2CM0_INTENSET								EQU SERCOM0 + I2CM_INTENSET_offset
I2CM0_INTFLAG									EQU SERCOM0 + I2CM_INTFLAG_offset
I2CM0_STATUS									EQU SERCOM0 + I2CM_STATUS_offset
I2CM0_SYNCBUSY								EQU SERCOM0 + I2CM_SYNCBUSY_offset
I2CM0_ADDR										EQU SERCOM0 + I2CM_ADDR_offset
I2CM0_DATA										EQU SERCOM0 + I2CM_DATA_offset
I2CM0_DBGCTRL									EQU SERCOM0 + I2CM_DBGCTRL_offset

I2CM1_CTRLA										EQU SERCOM1 + I2CM_CTRLA_offset
I2CM1_CTRLB										EQU SERCOM1 + I2CM_CTRLB_offset
I2CM1_BAUD										EQU SERCOM1 + I2CM_BAUD_offset
I2CM1_INTENCLR								EQU SERCOM1 + I2CM_INTENCLR_offset
I2CM1_INTENSET								EQU SERCOM1 + I2CM_INTENSET_offset
I2CM1_INTFLAG									EQU SERCOM1 + I2CM_INTFLAG_offset
I2CM1_STATUS									EQU SERCOM1 + I2CM_STATUS_offset
I2CM1_SYNCBUSY								EQU SERCOM1 + I2CM_SYNCBUSY_offset
I2CM1_ADDR										EQU SERCOM1 + I2CM_ADDR_offset
I2CM1_DATA										EQU SERCOM1 + I2CM_DATA_offset
I2CM1_DBGCTRL									EQU SERCOM1 + I2CM_DBGCTRL_offset

I2CM2_CTRLA										EQU SERCOM2 + I2CM_CTRLA_offset
I2CM2_CTRLB										EQU SERCOM2 + I2CM_CTRLB_offset
I2CM2_BAUD										EQU SERCOM2 + I2CM_BAUD_offset
I2CM2_INTENCLR								EQU SERCOM2 + I2CM_INTENCLR_offset
I2CM2_INTENSET								EQU SERCOM2 + I2CM_INTENSET_offset
I2CM2_INTFLAG									EQU SERCOM2 + I2CM_INTFLAG_offset
I2CM2_STATUS									EQU SERCOM2 + I2CM_STATUS_offset
I2CM2_SYNCBUSY								EQU SERCOM2 + I2CM_SYNCBUSY_offset
I2CM2_ADDR										EQU SERCOM2 + I2CM_ADDR_offset
I2CM2_DATA										EQU SERCOM2 + I2CM_DATA_offset
I2CM2_DBGCTRL									EQU SERCOM2 + I2CM_DBGCTRL_offset

