zoosmand/SAMD21G18A_eic/inc/samd21g18a.inc
I2CM3_CTRLA										EQU SERCOM3 + I2CM_CTRLA_offset
I2CM3_CTRLB										EQU SERCOM3 + I2CM_CTRLB_offset
I2CM3_BAUD										EQU SERCOM3 + I2CM_BAUD_offset
I2CM3_INTENCLR								EQU SERCOM3 + I2CM_INTENCLR_offset
I2CM3_INTENSET								EQU SERCOM3 + I2CM_INTENSET_offset
I2CM3_INTFLAG									EQU SERCOM3 + I2CM_INTFLAG_offset
I2CM3_STATUS									EQU SERCOM3 + I2CM_STATUS_offset
I2CM3_SYNCBUSY								EQU SERCOM3 + I2CM_SYNCBUSY_offset
I2CM3_ADDR										EQU SERCOM3 + I2CM_ADDR_offset
I2CM3_DATA										EQU SERCOM3 + I2CM_DATA_offset
I2CM3_DBGCTRL									EQU SERCOM3 + I2CM_DBGCTRL_offset

I2CM4_CTRLA										EQU SERCOM4 + I2CM_CTRLA_offset
I2CM4_CTRLB										EQU SERCOM4 + I2CM_CTRLB_offset
I2CM4_BAUD										EQU SERCOM4 + I2CM_BAUD_offset
I2CM4_INTENCLR								EQU SERCOM4 + I2CM_INTENCLR_offset
I2CM4_INTENSET								EQU SERCOM4 + I2CM_INTENSET_offset
I2CM4_INTFLAG									EQU SERCOM4 + I2CM_INTFLAG_offset
I2CM4_STATUS									EQU SERCOM4 + I2CM_STATUS_offset
I2CM4_SYNCBUSY								EQU SERCOM4 + I2CM_SYNCBUSY_offset
I2CM4_ADDR										EQU SERCOM4 + I2CM_ADDR_offset
I2CM4_DATA										EQU SERCOM4 + I2CM_DATA_offset
I2CM4_DBGCTRL									EQU SERCOM4 + I2CM_DBGCTRL_offset

I2CM5_CTRLA										EQU SERCOM5 + I2CM_CTRLA_offset
I2CM5_CTRLB										EQU SERCOM5 + I2CM_CTRLB_offset
I2CM5_BAUD										EQU SERCOM5 + I2CM_BAUD_offset
I2CM5_INTENCLR								EQU SERCOM5 + I2CM_INTENCLR_offset
I2CM5_INTENSET								EQU SERCOM5 + I2CM_INTENSET_offset
I2CM5_INTFLAG									EQU SERCOM5 + I2CM_INTFLAG_offset
I2CM5_STATUS									EQU SERCOM5 + I2CM_STATUS_offset
I2CM5_SYNCBUSY								EQU SERCOM5 + I2CM_SYNCBUSY_offset
I2CM5_ADDR										EQU SERCOM5 + I2CM_ADDR_offset
I2CM5_DATA										EQU SERCOM5 + I2CM_DATA_offset
I2CM5_DBGCTRL									EQU SERCOM5 + I2CM_DBGCTRL_offset


I2CM_CTRLA_SWRST							EQU BIT_POS_0
I2CM_CTRLA_ENABLE							EQU BIT_POS_1
I2CM_CTRLA_MODE_USART_EXT_CLK	EQU 0x00
I2CM_CTRLA_MODE_USART_INT_CLK	EQU 0x04
I2CM_CTRLA_MODE_SPI_SLAVE			EQU 0x08
I2CM_CTRLA_MODE_SPI_MASTER		EQU 0x0c
I2CM_CTRLA_MODE_I2C_SLAVE			EQU 0x10
I2CM_CTRLA_MODE_I2C_MASTER		EQU 0x14
I2CM_CTRLA_RUNSTDBY						EQU BIT_POS_7
I2CM_CTRLA_PINOUT							EQU BIT_POS_16
I2CM_CTRLA_SDAHOLD						EQU 0x0
I2CM_CTRLA_SDAHOLD_Pos				EQU 20
I2CM_CTRLA_MEXTTOEN						EQU BIT_POS_22
I2CM_CTRLA_SEXTTOEN						EQU BIT_POS_23
I2CM_CTRLA_SPEED							EQU 0x0
I2CM_CTRLA_SPEED_Pos					EQU 24
I2CM_CTRLA_SCLSM							EQU BIT_POS_27
I2CM_CTRLA_INACTOUT						EQU 0x0
I2CM_CTRLA_INACTOUT_Pos				EQU 28
I2CM_CTRLA_LOWTOUTEN					EQU BIT_POS_30

I2CM_CTRLB_SMEN								EQU BIT_POS_8
I2CM_CTRLB_QCEN								EQU BIT_POS_9
I2CM_CTRLB_CMD								EQU 0x0
I2CM_CTRLB_CMD_Pos						EQU 16
I2CM_CTRLB_ACKACT							EQU BIT_POS_18

I2CM_BAUD_BAUD								EQU 0x00
I2CM_BAUD_BAUD_Pos						EQU 0
I2CM_BAUD_BAUDLOW							EQU 0x00
I2CM_BAUD_BAUDLOW_Pos					EQU 8
I2CM_BAUD_HSBAUD							EQU 0x00
I2CM_BAUD_HSBAUD_Pos					EQU 16
I2CM_BAUD_HSBAUDLOW						EQU 0x00
I2CM_BAUD_HSBAUDLOW_Pos				EQU 24

I2CM_INTENCLR_MB							EQU BIT_POS_0
I2CM_INTENCLR_SB							EQU BIT_POS_1
I2CM_INTENCLR_ERROR						EQU BIT_POS_7

I2CM_INTENSET_MB							EQU BIT_POS_0
I2CM_INTENSET_SB							EQU BIT_POS_1
I2CM_INTENSET_ERROR						EQU BIT_POS_7

I2CM_INTFLAG_MB								EQU BIT_POS_0
I2CM_INTFLAG_MB_Pos						EQU 0
I2CM_INTFLAG_SB								EQU BIT_POS_1
I2CM_INTFLAG_SB_Pos						EQU 1
I2CM_INTFLAG_ERROR						EQU BIT_POS_7
I2CM_INTFLAG_ERROR_Pos				EQU 7

I2CM_STATUS_BUSERR						EQU BIT_POS_0
I2CM_STATUS_BUSERR_Pos				EQU 0
I2CM_STATUS_ARBLOST						EQU BIT_POS_1
I2CM_STATUS_ARBLOST_Pos				EQU 1
I2CM_STATUS_RXNACK						EQU BIT_POS_2
I2CM_STATUS_RXNACK_Pos				EQU 2
I2CM_STATUS_BUSSTATE					EQU 0x0
I2CM_STATUS_BUSSTATE_Pos			EQU 4
I2CM_STATUS_LOWTOUT						EQU BIT_POS_6
I2CM_STATUS_CLKHOLD						EQU BIT_POS_7
I2CM_STATUS_CLKHOLD_Pos				EQU 7
I2CM_STATUS_MEXTTOUT					EQU BIT_POS_8
I2CM_STATUS_SEXTTOUT					EQU BIT_POS_9
I2CM_STATUS_LENERR						EQU BIT_POS_10

I2CM_SYNCBUSY_SWRST						EQU BIT_POS_0
I2CM_SYNCBUSY_ENABLE					EQU BIT_POS_1
I2CM_SYNCBUSY_ENABLE_Pos			EQU 1
I2CM_SYNCBUSY_SYSOP						EQU BIT_POS_2
I2CM_SYNCBUSY_SYSOP_Pos				EQU 2

I2CM_ADDR_ADDR								EQU 0x00
I2CM_ADDR_ADDR_Pos						EQU 0
I2CM_ADDR_LENEN								EQU BIT_POS_13
I2CM_ADDR_HS									EQU BIT_POS_14
I2CM_ADDR_TENBITEN						EQU BIT_POS_15
I2CM_ADDR_LEN									EQU 0x00
I2CM_ADDR_LEN_Pos							EQU 16

I2CM_DATA_DATA								EQU 0x00
I2CM_DATA_DATA_Pos						EQU 0

I2CM_DBGCTRL_DBGSTOP					EQU BIT_POS_0






; I2CS
I2CS_CTRLA_offset							EQU 0x00
I2CS_CTRLB_offset							EQU 0x04
I2CS_INTENCLR_offset					EQU 0x14
I2CS_INTENSET_offset					EQU 0x16
I2CS_INTFLAG_offset						EQU 0x18
I2CS_STATUS_offset						EQU 0x1a
I2CS_SYNCBUSY_offset					EQU 0x1c
I2CS_ADDR_offset							EQU 0x24
I2CS_DATA_offset							EQU 0x28

I2CS0_CTRLA										EQU SERCOM0 + I2CS_CTRLA_offset
I2CS0_CTRLB										EQU SERCOM0 + I2CS_CTRLB_offset
I2CS0_INTENCLR								EQU SERCOM0 + I2CS_INTENCLR_offset
I2CS0_INTENSET								EQU SERCOM0 + I2CS_INTENSET_offset
I2CS0_INTFLAG									EQU SERCOM0 + I2CS_INTFLAG_offset
I2CS0_STATUS									EQU SERCOM0 + I2CS_STATUS_offset
I2CS0_SYNCBUSY								EQU SERCOM0 + I2CS_SYNCBUSY_offset
I2CS0_ADDR										EQU SERCOM0 + I2CS_ADDR_offset
I2CS0_DATA										EQU SERCOM0 + I2CS_DATA_offset

I2CS1_CTRLA										EQU SERCOM1 + I2CS_CTRLA_offset
I2CS1_CTRLB										EQU SERCOM1 + I2CS_CTRLB_offset
I2CS1_INTENCLR								EQU SERCOM1 + I2CS_INTENCLR_offset
I2CS1_INTENSET								EQU SERCOM1 + I2CS_INTENSET_offset
I2CS1_INTFLAG									EQU SERCOM1 + I2CS_INTFLAG_offset
I2CS1_STATUS									EQU SERCOM1 + I2CS_STATUS_offset
I2CS1_SYNCBUSY								EQU SERCOM1 + I2CS_SYNCBUSY_offset
I2CS1_ADDR										EQU SERCOM1 + I2CS_ADDR_offset
I2CS1_DATA										EQU SERCOM1 + I2CS_DATA_offset

I2CS2_CTRLA										EQU SERCOM2 + I2CS_CTRLA_offset
I2CS2_CTRLB										EQU SERCOM2 + I2CS_CTRLB_offset
I2CS2_INTENCLR								EQU SERCOM2 + I2CS_INTENCLR_offset
I2CS2_INTENSET								EQU SERCOM2 + I2CS_INTENSET_offset
I2CS2_INTFLAG									EQU SERCOM2 + I2CS_INTFLAG_offset
I2CS2_STATUS									EQU SERCOM2 + I2CS_STATUS_offset
I2CS2_SYNCBUSY								EQU SERCOM2 + I2CS_SYNCBUSY_offset
I2CS2_ADDR										EQU SERCOM2 + I2CS_ADDR_offset
I2CS2_DATA										EQU SERCOM2 + I2CS_DATA_offset

I2CS3_CTRLA										EQU SERCOM3 + I2CS_CTRLA_offset
I2CS3_CTRLB										EQU SERCOM3 + I2CS_CTRLB_offset
I2CS3_INTENCLR								EQU SERCOM3 + I2CS_INTENCLR_offset
I2CS3_INTENSET								EQU SERCOM3 + I2CS_INTENSET_offset
I2CS3_INTFLAG									EQU SERCOM3 + I2CS_INTFLAG_offset
I2CS3_STATUS									EQU SERCOM3 + I2CS_STATUS_offset
I2CS3_SYNCBUSY								EQU SERCOM3 + I2CS_SYNCBUSY_offset
I2CS3_ADDR										EQU SERCOM3 + I2CS_ADDR_offset
I2CS3_DATA										EQU SERCOM3 + I2CS_DATA_offset

I2CS4_CTRLA										EQU SERCOM4 + I2CS_CTRLA_offset
I2CS4_CTRLB										EQU SERCOM4 + I2CS_CTRLB_offset
I2CS4_INTENCLR								EQU SERCOM4 + I2CS_INTENCLR_offset
I2CS4_INTENSET								EQU SERCOM4 + I2CS_INTENSET_offset
I2CS4_INTFLAG									EQU SERCOM4 + I2CS_INTFLAG_offset
I2CS4_STATUS									EQU SERCOM4 + I2CS_STATUS_offset
I2CS4_SYNCBUSY								EQU SERCOM4 + I2CS_SYNCBUSY_offset
I2CS4_ADDR										EQU SERCOM4 + I2CS_ADDR_offset
I2CS4_DATA										EQU SERCOM4 + I2CS_DATA_offset

I2CS5_CTRLA										EQU SERCOM5 + I2CS_CTRLA_offset
I2CS5_CTRLB										EQU SERCOM5 + I2CS_CTRLB_offset
I2CS5_INTENCLR								EQU SERCOM5 + I2CS_INTENCLR_offset
I2CS5_INTENSET								EQU SERCOM5 + I2CS_INTENSET_offset
I2CS5_INTFLAG									EQU SERCOM5 + I2CS_INTFLAG_offset
I2CS5_STATUS									EQU SERCOM5 + I2CS_STATUS_offset
I2CS5_SYNCBUSY								EQU SERCOM5 + I2CS_SYNCBUSY_offset
I2CS5_ADDR										EQU SERCOM5 + I2CS_ADDR_offset
I2CS5_DATA										EQU SERCOM5 + I2CS_DATA_offset


I2CS_CTRLA_SWRST							EQU BIT_POS_0
I2CS_CTRLA_ENABLE							EQU BIT_POS_1
I2CS_CTRLA_MODE_USART_EXT_CLK	EQU 0x00
I2CS_CTRLA_MODE_USART_INT_CLK	EQU 0x04
I2CS_CTRLA_MODE_SPI_SLAVE			EQU 0x08
I2CS_CTRLA_MODE_SPI_MASTER		EQU 0x0c
I2CS_CTRLA_MODE_I2C_SLAVE			EQU 0x10
I2CS_CTRLA_MODE_I2C_MASTER		EQU 0x14
I2CS_CTRLA_RUNSTDBY						EQU BIT_POS_7
I2CS_CTRLA_PINOUT							EQU BIT_POS_16
I2CS_CTRLA_SDAHOLD						EQU 0x0
I2CS_CTRLA_SDAHOLD_Pos				EQU 20
I2CS_CTRLA_SEXTTOEN						EQU BIT_POS_23
I2CS_CTRLA_SPEED							EQU 0x0
I2CS_CTRLA_SPEED_Pos					EQU 24
I2CS_CTRLA_SCLSM							EQU BIT_POS_27
I2CS_CTRLA_LOWTOUTEN					EQU BIT_POS_30

I2CS_CTRLB_SMEN								EQU BIT_POS_8
I2CS_CTRLB_GCMD								EQU BIT_POS_9
I2CS_CTRLB_AACKEN							EQU BIT_POS_10
I2CS_CTRLB_AMODE							EQU 0x0
I2CS_CTRLB_AMODE_Pos					EQU 14
I2CS_CTRLB_CMD								EQU 0x0
I2CS_CTRLB_CMD_Pos						EQU 16
I2CS_CTRLB_ACKACT							EQU BIT_POS_18

I2CS_INTENCLR_PREC						EQU BIT_POS_0
I2CS_INTENCLR_AMATCH					EQU BIT_POS_1
I2CS_INTENCLR_DRDY						EQU BIT_POS_2
I2CS_INTENCLR_ERROR						EQU BIT_POS_7

I2CS_INTENSET_PREC						EQU BIT_POS_0
I2CS_INTENSET_AMATCH					EQU BIT_POS_1
I2CS_INTENSET_DRDY						EQU BIT_POS_2
I2CS_INTENSET_ERROR						EQU BIT_POS_7

I2CS_INTFLAG_PREC							EQU BIT_POS_0
I2CS_INTFLAG_AMATCH						EQU BIT_POS_1
I2CS_INTFLAG_DRDY							EQU BIT_POS_2
I2CS_INTFLAG_ERROR						EQU BIT_POS_7

I2CS_STATUS_BUSERR						EQU BIT_POS_0
I2CS_STATUS_COLL							EQU BIT_POS_1
I2CS_STATUS_RXNACK						EQU BIT_POS_2
I2CS_STATUS_DIR								EQU BIT_POS_3
I2CS_STATUS_SR								EQU BIT_POS_4
I2CS_STATUS_LOWTOUT						EQU BIT_POS_6
I2CS_STATUS_CLKHOLD						EQU BIT_POS_7
I2CS_STATUS_SEXTTOUT					EQU BIT_POS_9
I2CS_STATUS_HS								EQU BIT_POS_10

I2CS_ADDR_GENCEN							EQU BIT_POS_0
I2CS_ADDR_ADDR								EQU 0x00
I2CS_ADDR_ADDR_Pos						EQU 1
I2CS_ADDR_TENBITEN						EQU BIT_POS_15
I2CS_ADDR_ADDRMASK						EQU 0x00
I2CS_ADDR_ADDRMASK_Pos				EQU 17

I2CS_DATA_DATA								EQU 0x00
I2CS_DATA_DATA_Pos						EQU 0





; SPI
SPI_CTRLA_offset							EQU 0x00
SPI_CTRLB_offset							EQU 0x04
SPI_BAUD_offset								EQU 0x0c
SPI_INTENCLR_offset						EQU 0x14
SPI_INTENSET_offset						EQU 0x16
SPI_INTFLAG_offset						EQU 0x18
SPI_STATUS_offset							EQU 0x1a
SPI_SYNCBUSY_offset						EQU 0x1c
SPI_ADDR_offset								EQU 0x24
SPI_DATA_offset								EQU 0x28
SPI_DBGCTRL_offset						EQU 0x30

