zoosmand/SAMD21G18A_eic/inc/samd21g18a.inc
SPI0_CTRLA										EQU SERCOM0 + SPI_CTRLA_offset
SPI0_CTRLB										EQU SERCOM0 + SPI_CTRLB_offset
SPI0_BAUD											EQU SERCOM0 + SPI_BAUD_offset
SPI0_INTENCLR									EQU SERCOM0 + SPI_INTENCLR_offset
SPI0_INTENSET									EQU SERCOM0 + SPI_INTENSET_offset
SPI0_INTFLAG									EQU SERCOM0 + SPI_INTFLAG_offset
SPI0_STATUS										EQU SERCOM0 + SPI_STATUS_offset
SPI0_SYNCBUSY									EQU SERCOM0 + SPI_SYNCBUSY_offset
SPI0_ADDR											EQU SERCOM0 + SPI_ADDR_offset
SPI0_DATA											EQU SERCOM0 + SPI_DATA_offset
SPI0_DBGCTRL									EQU SERCOM0 + SPI_DBGCTRL_offset

SPI1_CTRLA										EQU SERCOM1 + SPI_CTRLA_offset
SPI1_CTRLB										EQU SERCOM1 + SPI_CTRLB_offset
SPI1_BAUD											EQU SERCOM1 + SPI_BAUD_offset
SPI1_INTENCLR									EQU SERCOM1 + SPI_INTENCLR_offset
SPI1_INTENSET									EQU SERCOM1 + SPI_INTENSET_offset
SPI1_INTFLAG									EQU SERCOM1 + SPI_INTFLAG_offset
SPI1_STATUS										EQU SERCOM1 + SPI_STATUS_offset
SPI1_SYNCBUSY									EQU SERCOM1 + SPI_SYNCBUSY_offset
SPI1_ADDR											EQU SERCOM1 + SPI_ADDR_offset
SPI1_DATA											EQU SERCOM1 + SPI_DATA_offset
SPI1_DBGCTRL									EQU SERCOM1 + SPI_DBGCTRL_offset

SPI2_CTRLA										EQU SERCOM2 + SPI_CTRLA_offset
SPI2_CTRLB										EQU SERCOM2 + SPI_CTRLB_offset
SPI2_BAUD											EQU SERCOM2 + SPI_BAUD_offset
SPI2_INTENCLR									EQU SERCOM2 + SPI_INTENCLR_offset
SPI2_INTENSET									EQU SERCOM2 + SPI_INTENSET_offset
SPI2_INTFLAG									EQU SERCOM2 + SPI_INTFLAG_offset
SPI2_STATUS										EQU SERCOM2 + SPI_STATUS_offset
SPI2_SYNCBUSY									EQU SERCOM2 + SPI_SYNCBUSY_offset
SPI2_ADDR											EQU SERCOM2 + SPI_ADDR_offset
SPI2_DATA											EQU SERCOM2 + SPI_DATA_offset
SPI2_DBGCTRL									EQU SERCOM2 + SPI_DBGCTRL_offset

SPI3_CTRLA										EQU SERCOM3 + SPI_CTRLA_offset
SPI3_CTRLB										EQU SERCOM3 + SPI_CTRLB_offset
SPI3_BAUD											EQU SERCOM3 + SPI_BAUD_offset
SPI3_INTENCLR									EQU SERCOM3 + SPI_INTENCLR_offset
SPI3_INTENSET									EQU SERCOM3 + SPI_INTENSET_offset
SPI3_INTFLAG									EQU SERCOM3 + SPI_INTFLAG_offset
SPI3_STATUS										EQU SERCOM3 + SPI_STATUS_offset
SPI3_SYNCBUSY									EQU SERCOM3 + SPI_SYNCBUSY_offset
SPI3_ADDR											EQU SERCOM3 + SPI_ADDR_offset
SPI3_DATA											EQU SERCOM3 + SPI_DATA_offset
SPI3_DBGCTRL									EQU SERCOM3 + SPI_DBGCTRL_offset

SPI4_CTRLA										EQU SERCOM4 + SPI_CTRLA_offset
SPI4_CTRLB										EQU SERCOM4 + SPI_CTRLB_offset
SPI4_BAUD											EQU SERCOM4 + SPI_BAUD_offset
SPI4_INTENCLR									EQU SERCOM4 + SPI_INTENCLR_offset
SPI4_INTENSET									EQU SERCOM4 + SPI_INTENSET_offset
SPI4_INTFLAG									EQU SERCOM4 + SPI_INTFLAG_offset
SPI4_STATUS										EQU SERCOM4 + SPI_STATUS_offset
SPI4_SYNCBUSY									EQU SERCOM4 + SPI_SYNCBUSY_offset
SPI4_ADDR											EQU SERCOM4 + SPI_ADDR_offset
SPI4_DATA											EQU SERCOM4 + SPI_DATA_offset
SPI4_DBGCTRL									EQU SERCOM4 + SPI_DBGCTRL_offset

SPI5_CTRLA										EQU SERCOM5 + SPI_CTRLA_offset
SPI5_CTRLB										EQU SERCOM5 + SPI_CTRLB_offset
SPI5_BAUD											EQU SERCOM5 + SPI_BAUD_offset
SPI5_INTENCLR									EQU SERCOM5 + SPI_INTENCLR_offset
SPI5_INTENSET									EQU SERCOM5 + SPI_INTENSET_offset
SPI5_INTFLAG									EQU SERCOM5 + SPI_INTFLAG_offset
SPI5_STATUS										EQU SERCOM5 + SPI_STATUS_offset
SPI5_SYNCBUSY									EQU SERCOM5 + SPI_SYNCBUSY_offset
SPI5_ADDR											EQU SERCOM5 + SPI_ADDR_offset
SPI5_DATA											EQU SERCOM5 + SPI_DATA_offset
SPI5_DBGCTRL									EQU SERCOM5 + SPI_DBGCTRL_offset


SPI_CTRLA_SWRST								EQU BIT_POS_0
SPI_CTRLA_ENABLE							EQU BIT_POS_1
SPI_CTRLA_MODE_USART_EXT_CLK	EQU 0x00
SPI_CTRLA_MODE_USART_INT_CLK	EQU 0x04
SPI_CTRLA_MODE_SPI_SLAVE			EQU 0x08
SPI_CTRLA_MODE_SPI_MASTER			EQU 0x0c
SPI_CTRLA_MODE_I2C_SLAVE			EQU 0x10
SPI_CTRLA_MODE_I2C_MASTER			EQU 0x14
SPI_CTRLA_RUNSTDBY						EQU BIT_POS_7
SPI_CTRLA_IBON								EQU BIT_POS_8
SPI_CTRLA_DOPO								EQU 0x0
SPI_CTRLA_DOPO_Pos						EQU 16
SPI_CTRLA_DIPO								EQU 0x0
SPI_CTRLA_DIPO_Pos						EQU 20
SPI_CTRLA_FORM								EQU 0x0
SPI_CTRLA_FORM_Pos						EQU 24
SPI_CTRLA_CPHA								EQU BIT_POS_28
SPI_CTRLA_CPOL								EQU BIT_POS_29
SPI_CTRLA_DORD								EQU BIT_POS_30

SPI_CTRLB_CHSIZE							EQU 0x0
SPI_CTRLB_CHSIZE_Pos					EQU 0
SPI_CTRLB_PLOADEN							EQU BIT_POS_6
SPI_CTRLB_SSDE								EQU BIT_POS_9
SPI_CTRLB_MSSEN								EQU BIT_POS_13
SPI_CTRLB_AMODE								EQU 0x0
SPI_CTRLB_AMODE_Pos						EQU 14
SPI_CTRLB_RXEN								EQU BIT_POS_17

SPI_BAUD_BAUD									EQU 0x00
SPI_BAUD_BAUD_Pos							EQU 0

SPI_INTENCLR_DRE							EQU BIT_POS_0
SPI_INTENCLR_TXC							EQU BIT_POS_1
SPI_INTENCLR_RXC							EQU BIT_POS_2
SPI_INTENCLR_SSL							EQU BIT_POS_3
SPI_INTENCLR_ERROR						EQU BIT_POS_7

SPI_INTENSET_DRE							EQU BIT_POS_0
SPI_INTENSET_TXC							EQU BIT_POS_1
SPI_INTENSET_RXC							EQU BIT_POS_2
SPI_INTENSET_SSL							EQU BIT_POS_3
SPI_INTENSET_ERROR						EQU BIT_POS_7

SPI_INTFLAG_DRE								EQU BIT_POS_0
SPI_INTFLAG_DRE_Pos						EQU 0
SPI_INTFLAG_TXC								EQU BIT_POS_1
SPI_INTFLAG_TXC_Pos						EQU 1
SPI_INTFLAG_RXC								EQU BIT_POS_2
SPI_INTFLAG_RXC_Pos						EQU 2
SPI_INTFLAG_SSL								EQU BIT_POS_3
SPI_INTFLAG_SSL_Pos						EQU 3
SPI_INTFLAG_ERROR							EQU BIT_POS_7
SPI_INTFLAG_ERROR_Pos					EQU 7

SPI_STATUS_BUFOVF							EQU BIT_POS_2
SPI_STATUS_BUFOVF_Pos					EQU 2

SPI_SYNCBUSY_SWRST						EQU BIT_POS_0
SPI_SYNCBUSY_SWRST_Pos				EQU 0
SPI_SYNCBUSY_ENABLE						EQU BIT_POS_1
SPI_SYNCBUSY_ENABLE_Pos				EQU 1
SPI_SYNCBUSY_CTRLB						EQU BIT_POS_2
SPI_SYNCBUSY_CTRLB_Pos				EQU 2

SPI_ADDR_ADDR									EQU 0x00
SPI_ADDR_ADDR_Pos							EQU 0
SPI_ADDR_ADDRMASK							EQU 0x00
SPI_ADDR_ADDRMASK_Pos					EQU 16

SPI_DATA_DATA									EQU 0x00
SPI_DATA_DATA_Pos							EQU 0

SPI_DBGCTRL_DBGSTOP						EQU BIT_POS_0








; USART
USART_CTRLA_offset							EQU 0x00
USART_CTRLB_offset							EQU 0x04
USART_BAUD_offset								EQU 0x0c
USART_BAUD_FRAC_MODE_offset			EQU 0x0c
USART_BAUD_FRACFP_MODE_offset		EQU 0x0c
USART_BAUD_USARTFP_MODE_offset	EQU 0x0c
USART_RXPL_offset								EQU 0x0e
USART_INTENCLR_offset						EQU 0x14
USART_INTENSET_offset						EQU 0x16
USART_INTFLAG_offset						EQU 0x18
USART_STATUS_offset							EQU 0x1a
USART_SYNCBUSY_offset						EQU 0x1c
USART_DATA_offset								EQU 0x28
USART_DBGCTRL_offset						EQU 0x30

