zoosmand/SAMD21G18A_eic/inc/samd21g18a.inc
USART0_CTRLA										EQU SERCOM0 + USART_CTRLA_offset
USART0_CTRLB										EQU SERCOM0 + USART_CTRLB_offset
USART0_BAUD											EQU SERCOM0 + USART_BAUD_offset
USART0_BAUD_FRAC_MODE						EQU SERCOM0 + USART_BAUD_FRAC_MODE_offset
USART0_BAUD_FRACFP_MODE					EQU SERCOM0 + USART_BAUD_FRACFP_MODE_offset
USART0_BAUD_USARTFP_MODE				EQU SERCOM0 + USART_BAUD_USARTFP_MODE_offset
USART0_RXPL											EQU SERCOM0 + USART_RXPL_offset
USART0_INTENCLR									EQU SERCOM0 + USART_INTENCLR_offset
USART0_INTENSET									EQU SERCOM0 + USART_INTENSET_offset
USART0_INTFLAG									EQU SERCOM0 + USART_INTFLAG_offset
USART0_STATUS										EQU SERCOM0 + USART_STATUS_offset
USART0_SYNCBUSY									EQU SERCOM0 + USART_SYNCBUSY_offset
USART0_DATA											EQU SERCOM0 + USART_DATA_offset
USART0_DBGCTRL									EQU SERCOM0 + USART_DBGCTRL_offset

USART1_CTRLA										EQU SERCOM1 + USART_CTRLA_offset
USART1_CTRLB										EQU SERCOM1 + USART_CTRLB_offset
USART1_BAUD											EQU SERCOM1 + USART_BAUD_offset
USART1_BAUD_FRAC_MODE						EQU SERCOM1 + USART_BAUD_FRAC_MODE_offset
USART1_BAUD_FRACFP_MODE					EQU SERCOM1 + USART_BAUD_FRACFP_MODE_offset
USART1_BAUD_USARTFP_MODE				EQU SERCOM1 + USART_BAUD_USARTFP_MODE_offset
USART1_RXPL											EQU SERCOM1 + USART_RXPL_offset
USART1_INTENCLR									EQU SERCOM1 + USART_INTENCLR_offset
USART1_INTENSET									EQU SERCOM1 + USART_INTENSET_offset
USART1_INTFLAG									EQU SERCOM1 + USART_INTFLAG_offset
USART1_STATUS										EQU SERCOM1 + USART_STATUS_offset
USART1_SYNCBUSY									EQU SERCOM1 + USART_SYNCBUSY_offset
USART1_DATA											EQU SERCOM1 + USART_DATA_offset
USART1_DBGCTRL									EQU SERCOM1 + USART_DBGCTRL_offset

USART2_CTRLA										EQU SERCOM2 + USART_CTRLA_offset
USART2_CTRLB										EQU SERCOM2 + USART_CTRLB_offset
USART2_BAUD											EQU SERCOM2 + USART_BAUD_offset
USART2_BAUD_FRAC_MODE						EQU SERCOM2 + USART_BAUD_FRAC_MODE_offset
USART2_BAUD_FRACFP_MODE					EQU SERCOM2 + USART_BAUD_FRACFP_MODE_offset
USART2_BAUD_USARTFP_MODE				EQU SERCOM2 + USART_BAUD_USARTFP_MODE_offset
USART2_RXPL											EQU SERCOM2 + USART_RXPL_offset
USART2_INTENCLR									EQU SERCOM2 + USART_INTENCLR_offset
USART2_INTENSET									EQU SERCOM2 + USART_INTENSET_offset
USART2_INTFLAG									EQU SERCOM2 + USART_INTFLAG_offset
USART2_STATUS										EQU SERCOM2 + USART_STATUS_offset
USART2_SYNCBUSY									EQU SERCOM2 + USART_SYNCBUSY_offset
USART2_DATA											EQU SERCOM2 + USART_DATA_offset
USART2_DBGCTRL									EQU SERCOM2 + USART_DBGCTRL_offset

USART3_CTRLA										EQU SERCOM3 + USART_CTRLA_offset
USART3_CTRLB										EQU SERCOM3 + USART_CTRLB_offset
USART3_BAUD											EQU SERCOM3 + USART_BAUD_offset
USART3_BAUD_FRAC_MODE						EQU SERCOM3 + USART_BAUD_FRAC_MODE_offset
USART3_BAUD_FRACFP_MODE					EQU SERCOM3 + USART_BAUD_FRACFP_MODE_offset
USART3_BAUD_USARTFP_MODE				EQU SERCOM3 + USART_BAUD_USARTFP_MODE_offset
USART3_RXPL											EQU SERCOM3 + USART_RXPL_offset
USART3_INTENCLR									EQU SERCOM3 + USART_INTENCLR_offset
USART3_INTENSET									EQU SERCOM3 + USART_INTENSET_offset
USART3_INTFLAG									EQU SERCOM3 + USART_INTFLAG_offset
USART3_STATUS										EQU SERCOM3 + USART_STATUS_offset
USART3_SYNCBUSY									EQU SERCOM3 + USART_SYNCBUSY_offset
USART3_DATA											EQU SERCOM3 + USART_DATA_offset
USART3_DBGCTRL									EQU SERCOM3 + USART_DBGCTRL_offset

USART4_CTRLA										EQU SERCOM4 + USART_CTRLA_offset
USART4_CTRLB										EQU SERCOM4 + USART_CTRLB_offset
USART4_BAUD											EQU SERCOM4 + USART_BAUD_offset
USART4_BAUD_FRAC_MODE						EQU SERCOM4 + USART_BAUD_FRAC_MODE_offset
USART4_BAUD_FRACFP_MODE					EQU SERCOM4 + USART_BAUD_FRACFP_MODE_offset
USART4_BAUD_USARTFP_MODE				EQU SERCOM4 + USART_BAUD_USARTFP_MODE_offset
USART4_RXPL											EQU SERCOM4 + USART_RXPL_offset
USART4_INTENCLR									EQU SERCOM4 + USART_INTENCLR_offset
USART4_INTENSET									EQU SERCOM4 + USART_INTENSET_offset
USART4_INTFLAG									EQU SERCOM4 + USART_INTFLAG_offset
USART4_STATUS										EQU SERCOM4 + USART_STATUS_offset
USART4_SYNCBUSY									EQU SERCOM4 + USART_SYNCBUSY_offset
USART4_DATA											EQU SERCOM4 + USART_DATA_offset
USART4_DBGCTRL									EQU SERCOM4 + USART_DBGCTRL_offset

USART5_CTRLA										EQU SERCOM5 + USART_CTRLA_offset
USART5_CTRLB										EQU SERCOM5 + USART_CTRLB_offset
USART5_BAUD											EQU SERCOM5 + USART_BAUD_offset
USART5_BAUD_FRAC_MODE						EQU SERCOM5 + USART_BAUD_FRAC_MODE_offset
USART5_BAUD_FRACFP_MODE					EQU SERCOM5 + USART_BAUD_FRACFP_MODE_offset
USART5_BAUD_USARTFP_MODE				EQU SERCOM5 + USART_BAUD_USARTFP_MODE_offset
USART5_RXPL											EQU SERCOM5 + USART_RXPL_offset
USART5_INTENCLR									EQU SERCOM5 + USART_INTENCLR_offset
USART5_INTENSET									EQU SERCOM5 + USART_INTENSET_offset
USART5_INTFLAG									EQU SERCOM5 + USART_INTFLAG_offset
USART5_STATUS										EQU SERCOM5 + USART_STATUS_offset
USART5_SYNCBUSY									EQU SERCOM5 + USART_SYNCBUSY_offset
USART5_DATA											EQU SERCOM5 + USART_DATA_offset
USART5_DBGCTRL									EQU SERCOM5 + USART_DBGCTRL_offset


USART_CTRLA_SWRST								EQU BIT_POS_0
USART_CTRLA_ENABLE							EQU BIT_POS_1
USART_CTRLA_MODE_USART_EXT_CLK	EQU 0x00
USART_CTRLA_MODE_USART_INT_CLK	EQU 0x04
USART_CTRLA_MODE_SPI_SLAVE			EQU 0x08
USART_CTRLA_MODE_SPI_MASTER			EQU 0x0c
USART_CTRLA_MODE_I2C_SLAVE			EQU 0x10
USART_CTRLA_MODE_I2C_MASTER			EQU 0x14
USART_CTRLA_RUNSTDBY						EQU BIT_POS_7
USART_CTRLA_IBON								EQU BIT_POS_8
USART_CTRLA_SAMPR								EQU 0x0
USART_CTRLA_SAMPR_Pos						EQU 13
USART_CTRLA_TXPO								EQU 0x0
USART_CTRLA_TXPO_Pos						EQU 16
USART_CTRLA_RXPO								EQU 0x0
USART_CTRLA_RXPO_Pos						EQU 20
USART_CTRLA_SAMPA								EQU 0x0
USART_CTRLA_SAMPA_Pos						EQU 22
USART_CTRLA_FORM								EQU 0x0
USART_CTRLA_FORM_Pos						EQU 24
USART_CTRLA_CMODE								EQU BIT_POS_28
USART_CTRLA_CPOL								EQU BIT_POS_29
USART_CTRLA_DORD								EQU BIT_POS_30

USART_BAUD_BAUD									EQU 0x00
USART_BAUD_BAUD_Pos							EQU 0

USART_BAUD_FRAC_MODE_BAUD				EQU 0x00
USART_BAUD_FRAC_MODE_BAUD_Pos		EQU 0
USART_BAUD_FRAC_MODE_FP					EQU 0x0
USART_BAUD_FRAC_MODE_FP_Pos			EQU 13

USART_BAUD_FRACFP_MODE_BAUD			EQU 0x00
USART_BAUD_FRACFP_MODE_BAUD_Pos	EQU 0
USART_BAUD_FRACFP_MODE_FP				EQU 0x0
USART_BAUD_FRACFP_MODE_FP_Pos		EQU 13

USART_BAUD_USARTFP_MODE_BAUD			EQU 0x00
USART_BAUD_USARTFP_MODE_BAUD_Pos	EQU 0

USART_RXPL_RXPL									EQU 0x00
USART_RXPL_RXPL_Pos							EQU 0

USART_INTENCLR_DRE							EQU BIT_POS_0
USART_INTENCLR_TXC							EQU BIT_POS_1
USART_INTENCLR_RXC							EQU BIT_POS_2
USART_INTENCLR_RXS							EQU BIT_POS_3
USART_INTENCLR_CTSIC						EQU BIT_POS_4
USART_INTENCLR_RXBRK						EQU BIT_POS_5
USART_INTENCLR_ERROR						EQU BIT_POS_7

USART_INTENSET_DRE							EQU BIT_POS_0
USART_INTENSET_TXC							EQU BIT_POS_1
USART_INTENSET_RXC							EQU BIT_POS_2
USART_INTENSET_RXS							EQU BIT_POS_3
USART_INTENSET_CTSIC						EQU BIT_POS_4
USART_INTENSET_RXBRK						EQU BIT_POS_5
USART_INTENSET_ERROR						EQU BIT_POS_7

USART_INTFLAG_DRE								EQU BIT_POS_0
USART_INTFLAG_TXC								EQU BIT_POS_1
USART_INTFLAG_RXC								EQU BIT_POS_2
USART_INTFLAG_RXS								EQU BIT_POS_3
USART_INTFLAG_CTSIC							EQU BIT_POS_4
USART_INTFLAG_RXBRK							EQU BIT_POS_5
USART_INTFLAG_ERROR							EQU BIT_POS_7

USART_STATUS_PERR								EQU BIT_POS_0
USART_STATUS_FERR								EQU BIT_POS_1
USART_STATUS_BUFOVF							EQU BIT_POS_2
USART_STATUS_CTS								EQU BIT_POS_3
USART_STATUS_ISF								EQU BIT_POS_4
USART_STATUS_COLL								EQU BIT_POS_5

USART_SYNCBUSY_SWRST						EQU BIT_POS_0
USART_SYNCBUSY_ENABLE						EQU BIT_POS_1
USART_SYNCBUSY_CTRLB						EQU BIT_POS_2

USART_DATA_DATA									EQU 0x00
USART_DATA_DATA_Pos							EQU 0

USART_DBGCTRL_DBGSTOP						EQU BIT_POS_0





	END
